/* automatically generated by rust-bindgen 0.60.1 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const _MAX_ITOSTR_BASE16_COUNT: u32 = 9;
pub const _MAX_ITOSTR_BASE10_COUNT: u32 = 12;
pub const _MAX_ITOSTR_BASE8_COUNT: u32 = 12;
pub const _MAX_ITOSTR_BASE2_COUNT: u32 = 33;
pub const _MAX_LTOSTR_BASE16_COUNT: u32 = 9;

pub const EDEADLOCK: u32 = 36;
pub const EADDRINUSE: u32 = 100;
pub const EADDRNOTAVAIL: u32 = 101;
pub const EAFNOSUPPORT: u32 = 102;
pub const EALREADY: u32 = 103;
pub const EBADMSG: u32 = 104;
pub const ECANCELED: u32 = 105;
pub const ECONNABORTED: u32 = 106;
pub const ECONNREFUSED: u32 = 107;
pub const ECONNRESET: u32 = 108;
pub const EDESTADDRREQ: u32 = 109;
pub const EHOSTUNREACH: u32 = 110;
pub const EIDRM: u32 = 111;
pub const EINPROGRESS: u32 = 112;
pub const EISCONN: u32 = 113;
pub const ELOOP: u32 = 114;
pub const EMSGSIZE: u32 = 115;
pub const ENETDOWN: u32 = 116;
pub const ENETRESET: u32 = 117;
pub const ENETUNREACH: u32 = 118;
pub const ENOBUFS: u32 = 119;
pub const ENODATA: u32 = 120;
pub const ENOLINK: u32 = 121;
pub const ENOMSG: u32 = 122;
pub const ENOPROTOOPT: u32 = 123;
pub const ENOSR: u32 = 124;
pub const ENOSTR: u32 = 125;
pub const ENOTCONN: u32 = 126;
pub const ENOTRECOVERABLE: u32 = 127;
pub const ENOTSOCK: u32 = 128;
pub const ENOTSUP: u32 = 129;
pub const EOPNOTSUPP: u32 = 130;
pub const EOTHER: u32 = 131;
pub const EOVERFLOW: u32 = 132;
pub const EOWNERDEAD: u32 = 133;
pub const EPROTO: u32 = 134;
pub const EPROTONOSUPPORT: u32 = 135;
pub const EPROTOTYPE: u32 = 136;
pub const ETIME: u32 = 137;
pub const ETIMEDOUT: u32 = 138;
pub const ETXTBSY: u32 = 139;
pub const EWOULDBLOCK: u32 = 140;
pub const _NLSCMPERROR: u32 = 2147483647;
pub const ORT_API_VERSION: u32 = 11;
pub const __SAL_H_FULL_VER: u32 = 140050727;
pub const __SPECSTRINGS_STRICT_LEVEL: u32 = 1;
pub const __drv_typeConst: u32 = 0;
pub const __drv_typeCond: u32 = 1;
pub const __drv_typeBitset: u32 = 2;
pub const __drv_typeExpr: u32 = 3;
pub type va_list = *mut ::std::os::raw::c_char;
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "fastcall" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure();
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn();
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    );
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        12usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        4usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    fn test_field__locale_pctype() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_data_public>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_data_public),
                "::",
                stringify!(_locale_pctype)
            )
        );
    }
    test_field__locale_pctype();
    fn test_field__locale_mb_cur_max() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_data_public>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_data_public),
                "::",
                stringify!(_locale_mb_cur_max)
            )
        );
    }
    test_field__locale_mb_cur_max();
    fn test_field__locale_lc_codepage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_data_public>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_data_public),
                "::",
                stringify!(_locale_lc_codepage)
            )
        );
    }
    test_field__locale_lc_codepage();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        4usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    fn test_field_locinfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_pointers>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_pointers),
                "::",
                stringify!(locinfo)
            )
        );
    }
    test_field_locinfo();
    fn test_field_mbcinfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<__crt_locale_pointers>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__crt_locale_pointers),
                "::",
                stringify!(mbcinfo)
            )
        );
    }
    test_field_mbcinfo();
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    fn test_field__Wchar() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_Mbstatet>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_Mbstatet),
                "::",
                stringify!(_Wchar)
            )
        );
    }
    test_field__Wchar();
    fn test_field__Byte() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_Mbstatet>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_Mbstatet),
                "::",
                stringify!(_Byte)
            )
        );
    }
    test_field__Byte();
    fn test_field__State() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_Mbstatet>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize
            },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(_Mbstatet),
                "::",
                stringify!(_State)
            )
        );
    }
    test_field__State();
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _calloc_base(_Count: usize, _Size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        _Count: ::std::os::raw::c_uint,
        _Size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _callnewh(_Size: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _expand(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _free_base(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn free(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _malloc_base(_Size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn malloc(_Size: ::std::os::raw::c_uint) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _msize_base(_Block: *mut ::std::os::raw::c_void) -> usize;
}
extern "C" {
    pub fn _msize(_Block: *mut ::std::os::raw::c_void) -> usize;
}
extern "C" {
    pub fn _realloc_base(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _recalloc_base(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_free(_Block: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn _aligned_malloc(_Size: usize, _Alignment: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_offset_malloc(
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_msize(
        _Block: *mut ::std::os::raw::c_void,
        _Alignment: usize,
        _Offset: usize,
    ) -> usize;
}
extern "C" {
    pub fn _aligned_offset_realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_offset_recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_realloc(
        _Block: *mut ::std::os::raw::c_void,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _aligned_recalloc(
        _Block: *mut ::std::os::raw::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __threadid() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __threadhandle() -> usize;
}
pub type _CoreCrtSecureSearchSortCompareFunction = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type _CoreCrtNonSecureSearchSortCompareFunction = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort_s(
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn bsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    );
}
extern "C" {
    pub fn _lfind_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _lfind(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _lsearch_s(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _lsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn lfind(
        _Key: *const ::std::os::raw::c_void,
        _Base: *const ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn lsearch(
        _Key: *const ::std::os::raw::c_void,
        _Base: *mut ::std::os::raw::c_void,
        _NumOfElements: *mut ::std::os::raw::c_uint,
        _SizeOfElements: ::std::os::raw::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn _itow_s(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _itow(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _ltow_s(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ltow(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _ultow_s(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ultow(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstod(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn _wcstod_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn wcstol(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wcstol_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn wcstoll(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoll_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn wcstoul(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _wcstoul_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn wcstoull(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wcstoull_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn wcstold(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn _wcstold_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn wcstof(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f32;
}
extern "C" {
    pub fn _wcstof_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f32;
}
extern "C" {
    pub fn _wtof(_String: *const wchar_t) -> f64;
}
extern "C" {
    pub fn _wtof_l(_String: *const wchar_t, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn _wtoi(_String: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtoi_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtol(_String: *const wchar_t) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wtol_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wtoll(_String: *const wchar_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wtoll_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _i64tow_s(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _i64tow(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _ui64tow_s(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ui64tow(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wtoi64(_String: *const wchar_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wtoi64_l(_String: *const wchar_t, _Locale: _locale_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoi64(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoi64_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoui64(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wcstoui64_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wfullpath(
        _Buffer: *mut wchar_t,
        _Path: *const wchar_t,
        _BufferCount: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wmakepath_s(
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wmakepath(
        _Buffer: *mut wchar_t,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    );
}
extern "C" {
    pub fn _wperror(_ErrorMessage: *const wchar_t);
}
extern "C" {
    pub fn _wsplitpath(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _Dir: *mut wchar_t,
        _Filename: *mut wchar_t,
        _Ext: *mut wchar_t,
    );
}
extern "C" {
    pub fn _wsplitpath_s(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _DriveCount: usize,
        _Dir: *mut wchar_t,
        _DirCount: usize,
        _Filename: *mut wchar_t,
        _FilenameCount: usize,
        _Ext: *mut wchar_t,
        _ExtCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wdupenv_s(
        _Buffer: *mut *mut wchar_t,
        _BufferCount: *mut usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wgetenv(_VarName: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wgetenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wputenv(_EnvString: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wputenv_s(_Name: *const wchar_t, _Value: *const wchar_t) -> errno_t;
}
extern "C" {
    pub fn _wsearchenv_s(
        _Filename: *const wchar_t,
        _VarName: *const wchar_t,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wsearchenv(
        _Filename: *const wchar_t,
        _VarName: *const wchar_t,
        _ResultPath: *mut wchar_t,
    );
}
extern "C" {
    pub fn _wsystem(_Command: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _swab(
        _Buf1: *mut ::std::os::raw::c_char,
        _Buf2: *mut ::std::os::raw::c_char,
        _SizeInBytes: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn exit(_Code: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _exit(_Code: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(_Code: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(_Code: ::std::os::raw::c_int);
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn _set_abort_behavior(
        _Flags: ::std::os::raw::c_uint,
        _Mask: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
pub type _onexit_t = ::std::option::Option<unsafe extern "C" fn() -> ::std::os::raw::c_int>;
extern "C" {
    pub fn atexit(arg1: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _onexit(_Func: _onexit_t) -> _onexit_t;
}
extern "C" {
    pub fn at_quick_exit(
        arg1: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
pub type _purecall_handler = ::std::option::Option<unsafe extern "C" fn()>;
pub type _invalid_parameter_handler = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const wchar_t,
        arg2: *const wchar_t,
        arg3: *const wchar_t,
        arg4: ::std::os::raw::c_uint,
        arg5: usize,
    ),
>;
extern "C" {
    pub fn _set_purecall_handler(_Handler: _purecall_handler) -> _purecall_handler;
}
extern "C" {
    pub fn _get_purecall_handler() -> _purecall_handler;
}
extern "C" {
    pub fn _set_invalid_parameter_handler(
        _Handler: _invalid_parameter_handler,
    ) -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _get_invalid_parameter_handler() -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _set_thread_local_invalid_parameter_handler(
        _Handler: _invalid_parameter_handler,
    ) -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _get_thread_local_invalid_parameter_handler() -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _set_error_mode(_Mode: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __doserrno() -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _set_doserrno(_Value: ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
    pub fn _get_doserrno(_Value: *mut ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
    pub fn __sys_errlist() -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __sys_nerr() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(_ErrMsg: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn __p__pgmptr() -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __p__wpgmptr() -> *mut *mut wchar_t;
}
extern "C" {
    pub fn __p__fmode() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _get_pgmptr(_Value: *mut *mut ::std::os::raw::c_char) -> errno_t;
}
extern "C" {
    pub fn _get_wpgmptr(_Value: *mut *mut wchar_t) -> errno_t;
}
extern "C" {
    pub fn _set_fmode(_Mode: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_fmode(_PMode: *mut ::std::os::raw::c_int) -> errno_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__div_t() {
    assert_eq!(
        ::std::mem::size_of::<_div_t>(),
        8usize,
        concat!("Size of: ", stringify!(_div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_div_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_div_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_div_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_div_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_div_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
pub type div_t = _div_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout__ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<_ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ldiv_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_ldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_ldiv_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_ldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(_ldiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
pub type ldiv_t = _ldiv_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout__lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<_lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_lldiv_t))
    );
    fn test_field_quot() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_lldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_lldiv_t),
                "::",
                stringify!(quot)
            )
        );
    }
    test_field_quot();
    fn test_field_rem() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_lldiv_t>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_lldiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    test_field_rem();
}
pub type lldiv_t = _lldiv_t;
extern "C" {
    pub fn abs(_Number: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(_Number: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(_Number: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _abs64(_Number: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _byteswap_ushort(_Number: ::std::os::raw::c_ushort) -> ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn _byteswap_ulong(_Number: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _byteswap_uint64(_Number: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn div(_Numerator: ::std::os::raw::c_int, _Denominator: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(_Numerator: ::std::os::raw::c_long, _Denominator: ::std::os::raw::c_long)
        -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        _Numerator: ::std::os::raw::c_longlong,
        _Denominator: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn _rotl(
        _Value: ::std::os::raw::c_uint,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _lrotl(
        _Value: ::std::os::raw::c_ulong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _rotl64(
        _Value: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _rotr(
        _Value: ::std::os::raw::c_uint,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _lrotr(
        _Value: ::std::os::raw::c_ulong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _rotr64(
        _Value: ::std::os::raw::c_ulonglong,
        _Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn srand(_Seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LDOUBLE {
    pub ld: [::std::os::raw::c_uchar; 10usize],
}
#[test]
fn bindgen_test_layout__LDOUBLE() {
    assert_eq!(
        ::std::mem::size_of::<_LDOUBLE>(),
        10usize,
        concat!("Size of: ", stringify!(_LDOUBLE))
    );
    assert_eq!(
        ::std::mem::align_of::<_LDOUBLE>(),
        1usize,
        concat!("Alignment of ", stringify!(_LDOUBLE))
    );
    fn test_field_ld() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_LDOUBLE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ld) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_LDOUBLE),
                "::",
                stringify!(ld)
            )
        );
    }
    test_field_ld();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CRT_DOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__CRT_DOUBLE() {
    assert_eq!(
        ::std::mem::size_of::<_CRT_DOUBLE>(),
        8usize,
        concat!("Size of: ", stringify!(_CRT_DOUBLE))
    );
    assert_eq!(
        ::std::mem::align_of::<_CRT_DOUBLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_CRT_DOUBLE))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_CRT_DOUBLE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_CRT_DOUBLE),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CRT_FLOAT {
    pub f: f32,
}
#[test]
fn bindgen_test_layout__CRT_FLOAT() {
    assert_eq!(
        ::std::mem::size_of::<_CRT_FLOAT>(),
        4usize,
        concat!("Size of: ", stringify!(_CRT_FLOAT))
    );
    assert_eq!(
        ::std::mem::align_of::<_CRT_FLOAT>(),
        4usize,
        concat!("Alignment of ", stringify!(_CRT_FLOAT))
    );
    fn test_field_f() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_CRT_FLOAT>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).f) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_CRT_FLOAT),
                "::",
                stringify!(f)
            )
        );
    }
    test_field_f();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LONGDOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__LONGDOUBLE() {
    assert_eq!(
        ::std::mem::size_of::<_LONGDOUBLE>(),
        8usize,
        concat!("Size of: ", stringify!(_LONGDOUBLE))
    );
    assert_eq!(
        ::std::mem::align_of::<_LONGDOUBLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_LONGDOUBLE))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_LONGDOUBLE>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_LONGDOUBLE),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LDBL12 {
    pub ld12: [::std::os::raw::c_uchar; 12usize],
}
#[test]
fn bindgen_test_layout__LDBL12() {
    assert_eq!(
        ::std::mem::size_of::<_LDBL12>(),
        12usize,
        concat!("Size of: ", stringify!(_LDBL12))
    );
    assert_eq!(
        ::std::mem::align_of::<_LDBL12>(),
        1usize,
        concat!("Alignment of ", stringify!(_LDBL12))
    );
    fn test_field_ld12() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<_LDBL12>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ld12) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_LDBL12),
                "::",
                stringify!(ld12)
            )
        );
    }
    test_field_ld12();
}
extern "C" {
    pub fn atof(_String: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _atoi64(_String: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _atof_l(_String: *const ::std::os::raw::c_char, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn _atoi_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atol_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _atoll_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _atoi64_l(
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _atoflt(
        _Result: *mut _CRT_FLOAT,
        _String: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atodbl(
        _Result: *mut _CRT_DOUBLE,
        _String: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atoldbl(
        _Result: *mut _LDOUBLE,
        _String: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atoflt_l(
        _Result: *mut _CRT_FLOAT,
        _String: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atodbl_l(
        _Result: *mut _CRT_DOUBLE,
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _atoldbl_l(
        _Result: *mut _LDOUBLE,
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strtof(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn _strtof_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f32;
}
extern "C" {
    pub fn strtod(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn _strtod_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtold(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn _strtold_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtol(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _strtol_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoll(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _strtoll_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoul(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _strtoul_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoull(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strtoull_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strtoi64(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _strtoi64_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _strtoui64(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _strtoui64_l(
        _String: *const ::std::os::raw::c_char,
        _EndPtr: *mut *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _itoa_s(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _itoa(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ltoa_s(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ltoa(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ultoa_s(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ultoa(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _i64toa_s(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _i64toa(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ui64toa_s(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ui64toa(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _ecvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ecvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _fcvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _fcvt(
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _gcvt_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _gcvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ___mb_cur_max_func() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ___mb_cur_max_l_func(_Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(_Ch: *const ::std::os::raw::c_char, _MaxCount: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mblen_l(
        _Ch: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mbstrlen(_String: *const ::std::os::raw::c_char) -> usize;
}
extern "C" {
    pub fn _mbstrlen_l(_String: *const ::std::os::raw::c_char, _Locale: _locale_t) -> usize;
}
extern "C" {
    pub fn _mbstrnlen(_String: *const ::std::os::raw::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _mbstrnlen_l(
        _String: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn mbtowc(
        _DstCh: *mut wchar_t,
        _SrcCh: *const ::std::os::raw::c_char,
        _SrcSizeInBytes: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _mbtowc_l(
        _DstCh: *mut wchar_t,
        _SrcCh: *const ::std::os::raw::c_char,
        _SrcSizeInBytes: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs_s(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn mbstowcs(
        _Dest: *mut wchar_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> usize;
}
extern "C" {
    pub fn _mbstowcs_s_l(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _mbstowcs_l(
        _Dest: *mut wchar_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wctomb(_MbCh: *mut ::std::os::raw::c_char, _WCh: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wctomb_l(
        _MbCh: *mut ::std::os::raw::c_char,
        _WCh: wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb_s(
        _SizeConverted: *mut ::std::os::raw::c_int,
        _MbCh: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _WCh: wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wctomb_s_l(
        _SizeConverted: *mut ::std::os::raw::c_int,
        _MbCh: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _WCh: wchar_t,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstombs_s(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstombs(
        _Dest: *mut ::std::os::raw::c_char,
        _Source: *const wchar_t,
        _MaxCount: usize,
    ) -> usize;
}
extern "C" {
    pub fn _wcstombs_s_l(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcstombs_l(
        _Dest: *mut ::std::os::raw::c_char,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn _fullpath(
        _Buffer: *mut ::std::os::raw::c_char,
        _Path: *const ::std::os::raw::c_char,
        _BufferCount: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _makepath_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Drive: *const ::std::os::raw::c_char,
        _Dir: *const ::std::os::raw::c_char,
        _Filename: *const ::std::os::raw::c_char,
        _Ext: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn _makepath(
        _Buffer: *mut ::std::os::raw::c_char,
        _Drive: *const ::std::os::raw::c_char,
        _Dir: *const ::std::os::raw::c_char,
        _Filename: *const ::std::os::raw::c_char,
        _Ext: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn _splitpath(
        _FullPath: *const ::std::os::raw::c_char,
        _Drive: *mut ::std::os::raw::c_char,
        _Dir: *mut ::std::os::raw::c_char,
        _Filename: *mut ::std::os::raw::c_char,
        _Ext: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn _splitpath_s(
        _FullPath: *const ::std::os::raw::c_char,
        _Drive: *mut ::std::os::raw::c_char,
        _DriveCount: usize,
        _Dir: *mut ::std::os::raw::c_char,
        _DirCount: usize,
        _Filename: *mut ::std::os::raw::c_char,
        _FilenameCount: usize,
        _Ext: *mut ::std::os::raw::c_char,
        _ExtCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn getenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: rsize_t,
        _VarName: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn __p___argc() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn __p___argv() -> *mut *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __p___wargv() -> *mut *mut *mut wchar_t;
}
extern "C" {
    pub fn __p__environ() -> *mut *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __p__wenviron() -> *mut *mut *mut wchar_t;
}
extern "C" {
    pub fn getenv(_VarName: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _dupenv_s(
        _Buffer: *mut *mut ::std::os::raw::c_char,
        _BufferCount: *mut usize,
        _VarName: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn system(_Command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putenv(_EnvString: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putenv_s(
        _Name: *const ::std::os::raw::c_char,
        _Value: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn _searchenv_s(
        _Filename: *const ::std::os::raw::c_char,
        _VarName: *const ::std::os::raw::c_char,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _searchenv(
        _Filename: *const ::std::os::raw::c_char,
        _VarName: *const ::std::os::raw::c_char,
        _Buffer: *mut ::std::os::raw::c_char,
    );
}
extern "C" {
    pub fn _seterrormode(_Mode: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _beep(_Frequency: ::std::os::raw::c_uint, _Duration: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn _sleep(_Duration: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn ecvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        _Value: f64,
        _FractionalDigitCount: ::std::os::raw::c_int,
        _PtDec: *mut ::std::os::raw::c_int,
        _PtSign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        _Value: f64,
        _DigitCount: ::std::os::raw::c_int,
        _DstBuf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn itoa(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ltoa(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn swab(
        _Buf1: *mut ::std::os::raw::c_char,
        _Buf2: *mut ::std::os::raw::c_char,
        _SizeInBytes: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn ultoa(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut ::std::os::raw::c_char,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(_EnvString: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn onexit(_Func: _onexit_t) -> _onexit_t;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
extern "C" {
    pub fn memchr(
        _Buf: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        _Dst: *mut ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strchr(
        _Str: *const ::std::os::raw::c_char,
        _Val: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        _Str: *const ::std::os::raw::c_char,
        _Ch: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        _Str: *const ::std::os::raw::c_char,
        _SubStr: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn wcschr(
        _Str: *const ::std::os::raw::c_ushort,
        _Ch: ::std::os::raw::c_ushort,
    ) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _memicmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _memicmp_l(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memccpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memicmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcscpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstok_s(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscat(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(
        _String1: *const ::std::os::raw::c_ushort,
        _String2: *const ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscpy(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcslen(_String: *const ::std::os::raw::c_ushort) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn wcsnlen(_Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn wcsncat(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncmp(
        _String1: *const ::std::os::raw::c_ushort,
        _String2: *const ::std::os::raw::c_ushort,
        _MaxCount: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsncpy(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcspbrk(_String: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcstok(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcserror(_ErrorNumber: ::std::os::raw::c_int) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn __wcserror(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn __wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorMessage: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnset_s(
        _Destination: *mut wchar_t,
        _SizeInWords: usize,
        _Value: wchar_t,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsset_s(_Destination: *mut wchar_t, _SizeInWords: usize, _Value: wchar_t) -> errno_t;
}
extern "C" {
    pub fn _wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcslwr_s(_String: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcslwr_s_l(_String: *mut wchar_t, _SizeInWords: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcslwr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsupr_s(_String: *mut wchar_t, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsupr_s_l(_String: *mut wchar_t, _Size: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcsupr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsxfrm(_Destination: *mut wchar_t, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _wcsxfrm_l(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wcscoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcscoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsncoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsncoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strcat_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn strncat_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strncpy_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strtok_s(
        _String: *mut ::std::os::raw::c_char,
        _Delimiter: *const ::std::os::raw::c_char,
        _Context: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _memccpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcat(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        _Str1: *const ::std::os::raw::c_char,
        _Str2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strcmpi(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strcoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _strdup(_Source: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strerror(_ErrorMessage: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strerror_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _ErrorMessage: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror(_ErrorMessage: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _stricmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricmp_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strlen(_Str: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _strlwr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strlwr_s_l(
        _String: *mut ::std::os::raw::c_char,
        _Size: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _strlwr_l(
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _Count: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncmp(
        _Str1: *const ::std::os::raw::c_char,
        _Str2: *const ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicmp_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strncoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strncoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __strncnt(_String: *const ::std::os::raw::c_char, _Count: usize) -> usize;
}
extern "C" {
    pub fn strncpy(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _Count: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnlen(_String: *const ::std::os::raw::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _strnset_s(
        _String: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _Value: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _strnset(
        _Destination: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
        _Count: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strpbrk(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strrev(_Str: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strset_s(
        _Destination: *mut ::std::os::raw::c_char,
        _DestinationSize: usize,
        _Value: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _strset(
        _Destination: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strspn(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strtok(
        _String: *mut ::std::os::raw::c_char,
        _Delimiter: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strupr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strupr_s_l(
        _String: *mut ::std::os::raw::c_char,
        _Size: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _strupr_l(
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strxfrm(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn _strxfrm_l(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(_String: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmpi(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn stricmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnicmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strnset(
        _String: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrev(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strset(
        _String: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(i32)]
#[doc = " Copied from TensorProto::DataType"]
#[doc = " Currently, Ort doesn't support complex64, complex128"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ONNXTensorElementDataType {
    ONNX_TENSOR_ELEMENT_DATA_TYPE_UNDEFINED = 0,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_FLOAT = 1,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_UINT8 = 2,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_INT8 = 3,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_UINT16 = 4,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_INT16 = 5,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_INT32 = 6,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_INT64 = 7,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_STRING = 8,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_BOOL = 9,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_FLOAT16 = 10,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_DOUBLE = 11,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_UINT32 = 12,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_UINT64 = 13,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_COMPLEX64 = 14,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_COMPLEX128 = 15,
    ONNX_TENSOR_ELEMENT_DATA_TYPE_BFLOAT16 = 16,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ONNXType {
    ONNX_TYPE_UNKNOWN = 0,
    ONNX_TYPE_TENSOR = 1,
    ONNX_TYPE_SEQUENCE = 2,
    ONNX_TYPE_MAP = 3,
    ONNX_TYPE_OPAQUE = 4,
    ONNX_TYPE_SPARSETENSOR = 5,
    ONNX_TYPE_OPTIONAL = 6,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OrtSparseFormat {
    ORT_SPARSE_UNDEFINED = 0,
    ORT_SPARSE_COO = 1,
    ORT_SPARSE_CSRC = 2,
    ORT_SPARSE_BLOCK_SPARSE = 4,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OrtSparseIndicesFormat {
    ORT_SPARSE_COO_INDICES = 0,
    ORT_SPARSE_CSR_INNER_INDICES = 1,
    ORT_SPARSE_CSR_OUTER_INDICES = 2,
    ORT_SPARSE_BLOCK_SPARSE_INDICES = 3,
}
#[repr(i32)]
#[doc = " \\brief Logging severity levels"]
#[doc = ""]
#[doc = " In typical API usage, specifying a logging severity level specifies the minimum severity of log messages to show."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OrtLoggingLevel {
    #[doc = "< Verbose informational messages (least severe)."]
    ORT_LOGGING_LEVEL_VERBOSE = 0,
    #[doc = "< Informational messages."]
    ORT_LOGGING_LEVEL_INFO = 1,
    #[doc = "< Warning messages."]
    ORT_LOGGING_LEVEL_WARNING = 2,
    #[doc = "< Error messages."]
    ORT_LOGGING_LEVEL_ERROR = 3,
    #[doc = "< Fatal error messages (most severe)."]
    ORT_LOGGING_LEVEL_FATAL = 4,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OrtErrorCode {
    ORT_OK = 0,
    ORT_FAIL = 1,
    ORT_INVALID_ARGUMENT = 2,
    ORT_NO_SUCHFILE = 3,
    ORT_NO_MODEL = 4,
    ORT_ENGINE_ERROR = 5,
    ORT_RUNTIME_EXCEPTION = 6,
    ORT_INVALID_PROTOBUF = 7,
    ORT_MODEL_LOADED = 8,
    ORT_NOT_IMPLEMENTED = 9,
    ORT_INVALID_GRAPH = 10,
    ORT_EP_FAIL = 11,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtEnv {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtStatus {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtMemoryInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtIoBinding {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtSession {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtValue {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtRunOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtTypeInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtTensorTypeAndShapeInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtSessionOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtCustomOpDomain {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtMapTypeInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtSequenceTypeInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtModelMetadata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtThreadPoolParams {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtThreadingOptions {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtArenaCfg {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtPrepackedWeightsContainer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtTensorRTProviderOptionsV2 {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtCUDAProviderOptionsV2 {
    _unused: [u8; 0],
}
pub type OrtStatusPtr = *mut OrtStatus;
#[doc = " \\brief Memory allocation interface"]
#[doc = ""]
#[doc = " Structure of function pointers that defines a memory allocator. This can be created and filled in by the user for custom allocators."]
#[doc = ""]
#[doc = " When an allocator is passed to any function, be sure that the allocator object is not destroyed until the last allocated object using it is freed."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct OrtAllocator {
    #[doc = "< Must be initialized to ORT_API_VERSION"]
    pub version: u32,
    #[doc = "< Returns a pointer to an allocated block of `size` bytes"]
    pub Alloc: ::std::option::Option<
        unsafe extern "stdcall" fn(
            this_: *mut OrtAllocator,
            size: usize,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = "< Free a block of memory previously allocated with OrtAllocator::Alloc"]
    pub Free: ::std::option::Option<
        unsafe extern "stdcall" fn(this_: *mut OrtAllocator, p: *mut ::std::os::raw::c_void),
    >,
    #[doc = "< Return a pointer to an ::OrtMemoryInfo that describes this allocator"]
    pub Info: ::std::option::Option<
        unsafe extern "stdcall" fn(this_: *const OrtAllocator) -> *const OrtMemoryInfo,
    >,
}
#[test]
fn bindgen_test_layout_OrtAllocator() {
    assert_eq!(
        ::std::mem::size_of::<OrtAllocator>(),
        16usize,
        concat!("Size of: ", stringify!(OrtAllocator))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtAllocator>(),
        4usize,
        concat!("Alignment of ", stringify!(OrtAllocator))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtAllocator>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtAllocator),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_Alloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtAllocator>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Alloc) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtAllocator),
                "::",
                stringify!(Alloc)
            )
        );
    }
    test_field_Alloc();
    fn test_field_Free() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtAllocator>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Free) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtAllocator),
                "::",
                stringify!(Free)
            )
        );
    }
    test_field_Free();
    fn test_field_Info() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtAllocator>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Info) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtAllocator),
                "::",
                stringify!(Info)
            )
        );
    }
    test_field_Info();
}
pub type OrtLoggingFunction = ::std::option::Option<
    unsafe extern "stdcall" fn(
        param: *mut ::std::os::raw::c_void,
        severity: OrtLoggingLevel,
        category: *const ::std::os::raw::c_char,
        logid: *const ::std::os::raw::c_char,
        code_location: *const ::std::os::raw::c_char,
        message: *const ::std::os::raw::c_char,
    ),
>;
#[repr(i32)]
#[doc = " \\brief Graph optimization level"]
#[doc = ""]
#[doc = " Refer to https://www.onnxruntime.ai/docs/resources/graph-optimizations.html"]
#[doc = " for an in-depth understanding of Graph Optimizations"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum GraphOptimizationLevel {
    ORT_DISABLE_ALL = 0,
    ORT_ENABLE_BASIC = 1,
    ORT_ENABLE_EXTENDED = 2,
    ORT_ENABLE_ALL = 99,
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum ExecutionMode {
    ORT_SEQUENTIAL = 0,
    ORT_PARALLEL = 1,
}
#[repr(i32)]
#[doc = " \\brief Language projection identifiers"]
#[doc = " /see OrtApi::SetLanguageProjection"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OrtLanguageProjection {
    ORT_PROJECTION_C = 0,
    ORT_PROJECTION_CPLUSPLUS = 1,
    ORT_PROJECTION_CSHARP = 2,
    ORT_PROJECTION_PYTHON = 3,
    ORT_PROJECTION_JAVA = 4,
    ORT_PROJECTION_WINML = 5,
    ORT_PROJECTION_NODEJS = 6,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtKernelInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtKernelContext {
    _unused: [u8; 0],
}
#[repr(i32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OrtAllocatorType {
    OrtInvalidAllocator = -1,
    OrtDeviceAllocator = 0,
    OrtArenaAllocator = 1,
}
impl OrtMemType {
    pub const OrtMemTypeCPU: OrtMemType = OrtMemType::OrtMemTypeCPUOutput;
}
#[repr(i32)]
#[doc = " \\brief Memory types for allocated memory, execution provider specific types should be extended in each provider."]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OrtMemType {
    #[doc = "< Any CPU memory used by non-CPU execution provider"]
    OrtMemTypeCPUInput = -2,
    #[doc = "< CPU accessible memory outputted by non-CPU execution provider, i.e. CUDA_PINNED"]
    OrtMemTypeCPUOutput = -1,
    #[doc = "< The default allocator for execution provider"]
    OrtMemTypeDefault = 0,
}
#[repr(i32)]
#[doc = " \\brief Algorithm to use for cuDNN Convolution Op"]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum OrtCudnnConvAlgoSearch {
    OrtCudnnConvAlgoSearchExhaustive = 0,
    OrtCudnnConvAlgoSearchHeuristic = 1,
    OrtCudnnConvAlgoSearchDefault = 2,
}
#[doc = " \\brief CUDA Provider Options"]
#[doc = ""]
#[doc = " \\see OrtApi::SessionOptionsAppendExecutionProvider_CUDA"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtCUDAProviderOptions {
    #[doc = " \\brief CUDA device Id"]
    #[doc = "   Defaults to 0."]
    pub device_id: ::std::os::raw::c_int,
    #[doc = " \\brief CUDA Convolution algorithm search configuration."]
    #[doc = "   See enum OrtCudnnConvAlgoSearch for more details."]
    #[doc = "   Defaults to OrtCudnnConvAlgoSearchExhaustive."]
    pub cudnn_conv_algo_search: OrtCudnnConvAlgoSearch,
    #[doc = " \\brief CUDA memory limit (To use all possible memory pass in maximum size_t)"]
    #[doc = "   Defaults to SIZE_MAX."]
    #[doc = "   \\note If a ::OrtArenaCfg has been applied, it will override this field"]
    pub gpu_mem_limit: usize,
    #[doc = " \\brief Strategy used to grow the memory arena"]
    #[doc = "   0 = kNextPowerOfTwo<br>"]
    #[doc = "   1 = kSameAsRequested<br>"]
    #[doc = "   Defaults to 0."]
    #[doc = "   \\note If a ::OrtArenaCfg has been applied, it will override this field"]
    pub arena_extend_strategy: ::std::os::raw::c_int,
    #[doc = " \\brief Flag indicating if copying needs to take place on the same stream as the compute stream in the CUDA EP"]
    #[doc = "   0 = Use separate streams for copying and compute."]
    #[doc = "   1 = Use the same stream for copying and compute."]
    #[doc = "   Defaults to 1."]
    #[doc = "   WARNING: Setting this to 0 may result in data races for some models."]
    #[doc = "   Please see issue #4829 for more details."]
    pub do_copy_in_default_stream: ::std::os::raw::c_int,
    #[doc = " \\brief Flag indicating if there is a user provided compute stream"]
    #[doc = "   Defaults to 0."]
    pub has_user_compute_stream: ::std::os::raw::c_int,
    #[doc = " \\brief User provided compute stream."]
    #[doc = "   If provided, please set `has_user_compute_stream` to 1."]
    pub user_compute_stream: *mut ::std::os::raw::c_void,
    #[doc = " \\brief CUDA memory arena configuration parameters"]
    pub default_memory_arena_cfg: *mut OrtArenaCfg,
}
#[test]
fn bindgen_test_layout_OrtCUDAProviderOptions() {
    assert_eq!(
        ::std::mem::size_of::<OrtCUDAProviderOptions>(),
        32usize,
        concat!("Size of: ", stringify!(OrtCUDAProviderOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtCUDAProviderOptions>(),
        4usize,
        concat!("Alignment of ", stringify!(OrtCUDAProviderOptions))
    );
    fn test_field_device_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCUDAProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).device_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCUDAProviderOptions),
                "::",
                stringify!(device_id)
            )
        );
    }
    test_field_device_id();
    fn test_field_cudnn_conv_algo_search() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCUDAProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).cudnn_conv_algo_search) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCUDAProviderOptions),
                "::",
                stringify!(cudnn_conv_algo_search)
            )
        );
    }
    test_field_cudnn_conv_algo_search();
    fn test_field_gpu_mem_limit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCUDAProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gpu_mem_limit) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCUDAProviderOptions),
                "::",
                stringify!(gpu_mem_limit)
            )
        );
    }
    test_field_gpu_mem_limit();
    fn test_field_arena_extend_strategy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCUDAProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arena_extend_strategy) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCUDAProviderOptions),
                "::",
                stringify!(arena_extend_strategy)
            )
        );
    }
    test_field_arena_extend_strategy();
    fn test_field_do_copy_in_default_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCUDAProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).do_copy_in_default_stream) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCUDAProviderOptions),
                "::",
                stringify!(do_copy_in_default_stream)
            )
        );
    }
    test_field_do_copy_in_default_stream();
    fn test_field_has_user_compute_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCUDAProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).has_user_compute_stream) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCUDAProviderOptions),
                "::",
                stringify!(has_user_compute_stream)
            )
        );
    }
    test_field_has_user_compute_stream();
    fn test_field_user_compute_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCUDAProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).user_compute_stream) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCUDAProviderOptions),
                "::",
                stringify!(user_compute_stream)
            )
        );
    }
    test_field_user_compute_stream();
    fn test_field_default_memory_arena_cfg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCUDAProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).default_memory_arena_cfg) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCUDAProviderOptions),
                "::",
                stringify!(default_memory_arena_cfg)
            )
        );
    }
    test_field_default_memory_arena_cfg();
}
#[doc = " \\brief ROCM Provider Options"]
#[doc = ""]
#[doc = " \\see OrtApi::SessionOptionsAppendExecutionProvider_ROCM"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtROCMProviderOptions {
    #[doc = " \\brief ROCM device Id"]
    #[doc = "   Defaults to 0."]
    pub device_id: ::std::os::raw::c_int,
    #[doc = " \\brief ROCM MIOpen Convolution algorithm exaustive search option."]
    #[doc = "   Defaults to 0 (false)."]
    pub miopen_conv_exhaustive_search: ::std::os::raw::c_int,
    #[doc = " \\brief ROCM memory limit (To use all possible memory pass in maximum size_t)"]
    #[doc = "   Defaults to SIZE_MAX."]
    #[doc = "   \\note If a ::OrtArenaCfg has been applied, it will override this field"]
    pub gpu_mem_limit: usize,
    #[doc = " \\brief Strategy used to grow the memory arena"]
    #[doc = "   0 = kNextPowerOfTwo<br>"]
    #[doc = "   1 = kSameAsRequested<br>"]
    #[doc = "   Defaults to 0."]
    #[doc = "   \\note If a ::OrtArenaCfg has been applied, it will override this field"]
    pub arena_extend_strategy: ::std::os::raw::c_int,
    #[doc = " \\brief Flag indicating if copying needs to take place on the same stream as the compute stream in the ROCM EP"]
    #[doc = "   0 = Use separate streams for copying and compute."]
    #[doc = "   1 = Use the same stream for copying and compute."]
    #[doc = "   Defaults to 1."]
    #[doc = "   WARNING: Setting this to 0 may result in data races for some models."]
    #[doc = "   Please see issue #4829 for more details."]
    pub do_copy_in_default_stream: ::std::os::raw::c_int,
    #[doc = " \\brief Flag indicating if there is a user provided compute stream"]
    #[doc = "   Defaults to 0."]
    pub has_user_compute_stream: ::std::os::raw::c_int,
    #[doc = " \\brief User provided compute stream."]
    #[doc = "   If provided, please set `has_user_compute_stream` to 1."]
    pub user_compute_stream: *mut ::std::os::raw::c_void,
    #[doc = " \\brief ROCM memory arena configuration parameters"]
    pub default_memory_arena_cfg: *mut OrtArenaCfg,
}
#[test]
fn bindgen_test_layout_OrtROCMProviderOptions() {
    assert_eq!(
        ::std::mem::size_of::<OrtROCMProviderOptions>(),
        32usize,
        concat!("Size of: ", stringify!(OrtROCMProviderOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtROCMProviderOptions>(),
        4usize,
        concat!("Alignment of ", stringify!(OrtROCMProviderOptions))
    );
    fn test_field_device_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtROCMProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).device_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtROCMProviderOptions),
                "::",
                stringify!(device_id)
            )
        );
    }
    test_field_device_id();
    fn test_field_miopen_conv_exhaustive_search() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtROCMProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).miopen_conv_exhaustive_search) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtROCMProviderOptions),
                "::",
                stringify!(miopen_conv_exhaustive_search)
            )
        );
    }
    test_field_miopen_conv_exhaustive_search();
    fn test_field_gpu_mem_limit() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtROCMProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gpu_mem_limit) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtROCMProviderOptions),
                "::",
                stringify!(gpu_mem_limit)
            )
        );
    }
    test_field_gpu_mem_limit();
    fn test_field_arena_extend_strategy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtROCMProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arena_extend_strategy) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtROCMProviderOptions),
                "::",
                stringify!(arena_extend_strategy)
            )
        );
    }
    test_field_arena_extend_strategy();
    fn test_field_do_copy_in_default_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtROCMProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).do_copy_in_default_stream) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtROCMProviderOptions),
                "::",
                stringify!(do_copy_in_default_stream)
            )
        );
    }
    test_field_do_copy_in_default_stream();
    fn test_field_has_user_compute_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtROCMProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).has_user_compute_stream) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtROCMProviderOptions),
                "::",
                stringify!(has_user_compute_stream)
            )
        );
    }
    test_field_has_user_compute_stream();
    fn test_field_user_compute_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtROCMProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).user_compute_stream) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtROCMProviderOptions),
                "::",
                stringify!(user_compute_stream)
            )
        );
    }
    test_field_user_compute_stream();
    fn test_field_default_memory_arena_cfg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtROCMProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).default_memory_arena_cfg) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtROCMProviderOptions),
                "::",
                stringify!(default_memory_arena_cfg)
            )
        );
    }
    test_field_default_memory_arena_cfg();
}
#[doc = " \\brief TensorRT Provider Options"]
#[doc = ""]
#[doc = " \\see OrtApi::SessionOptionsAppendExecutionProvider_TensorRT"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtTensorRTProviderOptions {
    #[doc = "< CUDA device id (0 = default device)"]
    pub device_id: ::std::os::raw::c_int,
    pub has_user_compute_stream: ::std::os::raw::c_int,
    pub user_compute_stream: *mut ::std::os::raw::c_void,
    pub trt_max_partition_iterations: ::std::os::raw::c_int,
    pub trt_min_subgraph_size: ::std::os::raw::c_int,
    pub trt_max_workspace_size: usize,
    pub trt_fp16_enable: ::std::os::raw::c_int,
    pub trt_int8_enable: ::std::os::raw::c_int,
    pub trt_int8_calibration_table_name: *const ::std::os::raw::c_char,
    pub trt_int8_use_native_calibration_table: ::std::os::raw::c_int,
    pub trt_dla_enable: ::std::os::raw::c_int,
    pub trt_dla_core: ::std::os::raw::c_int,
    pub trt_dump_subgraphs: ::std::os::raw::c_int,
    pub trt_engine_cache_enable: ::std::os::raw::c_int,
    pub trt_engine_cache_path: *const ::std::os::raw::c_char,
    pub trt_engine_decryption_enable: ::std::os::raw::c_int,
    pub trt_engine_decryption_lib_path: *const ::std::os::raw::c_char,
    pub trt_force_sequential_engine_build: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_OrtTensorRTProviderOptions() {
    assert_eq!(
        ::std::mem::size_of::<OrtTensorRTProviderOptions>(),
        72usize,
        concat!("Size of: ", stringify!(OrtTensorRTProviderOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtTensorRTProviderOptions>(),
        4usize,
        concat!("Alignment of ", stringify!(OrtTensorRTProviderOptions))
    );
    fn test_field_device_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).device_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(device_id)
            )
        );
    }
    test_field_device_id();
    fn test_field_has_user_compute_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).has_user_compute_stream) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(has_user_compute_stream)
            )
        );
    }
    test_field_has_user_compute_stream();
    fn test_field_user_compute_stream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).user_compute_stream) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(user_compute_stream)
            )
        );
    }
    test_field_user_compute_stream();
    fn test_field_trt_max_partition_iterations() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_max_partition_iterations) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_max_partition_iterations)
            )
        );
    }
    test_field_trt_max_partition_iterations();
    fn test_field_trt_min_subgraph_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_min_subgraph_size) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_min_subgraph_size)
            )
        );
    }
    test_field_trt_min_subgraph_size();
    fn test_field_trt_max_workspace_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_max_workspace_size) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_max_workspace_size)
            )
        );
    }
    test_field_trt_max_workspace_size();
    fn test_field_trt_fp16_enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_fp16_enable) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_fp16_enable)
            )
        );
    }
    test_field_trt_fp16_enable();
    fn test_field_trt_int8_enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_int8_enable) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_int8_enable)
            )
        );
    }
    test_field_trt_int8_enable();
    fn test_field_trt_int8_calibration_table_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_int8_calibration_table_name) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_int8_calibration_table_name)
            )
        );
    }
    test_field_trt_int8_calibration_table_name();
    fn test_field_trt_int8_use_native_calibration_table() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_int8_use_native_calibration_table) as usize
                    - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_int8_use_native_calibration_table)
            )
        );
    }
    test_field_trt_int8_use_native_calibration_table();
    fn test_field_trt_dla_enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_dla_enable) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_dla_enable)
            )
        );
    }
    test_field_trt_dla_enable();
    fn test_field_trt_dla_core() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_dla_core) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_dla_core)
            )
        );
    }
    test_field_trt_dla_core();
    fn test_field_trt_dump_subgraphs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_dump_subgraphs) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_dump_subgraphs)
            )
        );
    }
    test_field_trt_dump_subgraphs();
    fn test_field_trt_engine_cache_enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_engine_cache_enable) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_engine_cache_enable)
            )
        );
    }
    test_field_trt_engine_cache_enable();
    fn test_field_trt_engine_cache_path() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_engine_cache_path) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_engine_cache_path)
            )
        );
    }
    test_field_trt_engine_cache_path();
    fn test_field_trt_engine_decryption_enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_engine_decryption_enable) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_engine_decryption_enable)
            )
        );
    }
    test_field_trt_engine_decryption_enable();
    fn test_field_trt_engine_decryption_lib_path() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_engine_decryption_lib_path) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_engine_decryption_lib_path)
            )
        );
    }
    test_field_trt_engine_decryption_lib_path();
    fn test_field_trt_force_sequential_engine_build() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtTensorRTProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).trt_force_sequential_engine_build) as usize
                    - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtTensorRTProviderOptions),
                "::",
                stringify!(trt_force_sequential_engine_build)
            )
        );
    }
    test_field_trt_force_sequential_engine_build();
}
#[doc = " \\brief MIGraphX Provider Options"]
#[doc = ""]
#[doc = " \\see OrtApi::SessionOptionsAppendExecutionProvider_MIGraphX"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtMIGraphXProviderOptions {
    pub device_id: ::std::os::raw::c_int,
    pub migraphx_fp16_enable: ::std::os::raw::c_int,
    pub migraphx_int8_enable: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_OrtMIGraphXProviderOptions() {
    assert_eq!(
        ::std::mem::size_of::<OrtMIGraphXProviderOptions>(),
        12usize,
        concat!("Size of: ", stringify!(OrtMIGraphXProviderOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtMIGraphXProviderOptions>(),
        4usize,
        concat!("Alignment of ", stringify!(OrtMIGraphXProviderOptions))
    );
    fn test_field_device_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtMIGraphXProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).device_id) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtMIGraphXProviderOptions),
                "::",
                stringify!(device_id)
            )
        );
    }
    test_field_device_id();
    fn test_field_migraphx_fp16_enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtMIGraphXProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).migraphx_fp16_enable) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtMIGraphXProviderOptions),
                "::",
                stringify!(migraphx_fp16_enable)
            )
        );
    }
    test_field_migraphx_fp16_enable();
    fn test_field_migraphx_int8_enable() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtMIGraphXProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).migraphx_int8_enable) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtMIGraphXProviderOptions),
                "::",
                stringify!(migraphx_int8_enable)
            )
        );
    }
    test_field_migraphx_int8_enable();
}
#[doc = " \\brief OpenVINO Provider Options"]
#[doc = ""]
#[doc = " \\see OrtApi::SessionOptionsAppendExecutionProvider_OpenVINO"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtOpenVINOProviderOptions {
    #[doc = " \\brief Device type string"]
    #[doc = ""]
    #[doc = " Valid settings are one of: \"CPU_FP32\", \"GPU_FP32\", \"GPU_FP16\", \"MYRIAD_FP16\", \"VAD-M_FP16\" or \"VAD-F_FP32\""]
    pub device_type: *const ::std::os::raw::c_char,
    #[doc = "< 0 = disabled, nonzero = enabled"]
    pub enable_vpu_fast_compile: ::std::os::raw::c_uchar,
    pub device_id: *const ::std::os::raw::c_char,
    #[doc = "< 0 = Use default number of threads"]
    pub num_of_threads: usize,
    #[doc = "< 0 = disabled, nonzero = enabled"]
    pub use_compiled_network: ::std::os::raw::c_uchar,
    pub blob_dump_path: *const ::std::os::raw::c_char,
    pub context: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_OrtOpenVINOProviderOptions() {
    assert_eq!(
        ::std::mem::size_of::<OrtOpenVINOProviderOptions>(),
        28usize,
        concat!("Size of: ", stringify!(OrtOpenVINOProviderOptions))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtOpenVINOProviderOptions>(),
        4usize,
        concat!("Alignment of ", stringify!(OrtOpenVINOProviderOptions))
    );
    fn test_field_device_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtOpenVINOProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).device_type) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtOpenVINOProviderOptions),
                "::",
                stringify!(device_type)
            )
        );
    }
    test_field_device_type();
    fn test_field_enable_vpu_fast_compile() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtOpenVINOProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enable_vpu_fast_compile) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtOpenVINOProviderOptions),
                "::",
                stringify!(enable_vpu_fast_compile)
            )
        );
    }
    test_field_enable_vpu_fast_compile();
    fn test_field_device_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtOpenVINOProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).device_id) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtOpenVINOProviderOptions),
                "::",
                stringify!(device_id)
            )
        );
    }
    test_field_device_id();
    fn test_field_num_of_threads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtOpenVINOProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).num_of_threads) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtOpenVINOProviderOptions),
                "::",
                stringify!(num_of_threads)
            )
        );
    }
    test_field_num_of_threads();
    fn test_field_use_compiled_network() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtOpenVINOProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).use_compiled_network) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtOpenVINOProviderOptions),
                "::",
                stringify!(use_compiled_network)
            )
        );
    }
    test_field_use_compiled_network();
    fn test_field_blob_dump_path() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtOpenVINOProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).blob_dump_path) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtOpenVINOProviderOptions),
                "::",
                stringify!(blob_dump_path)
            )
        );
    }
    test_field_blob_dump_path();
    fn test_field_context() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtOpenVINOProviderOptions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtOpenVINOProviderOptions),
                "::",
                stringify!(context)
            )
        );
    }
    test_field_context();
}
#[doc = " \\brief The helper interface to get the right version of OrtApi"]
#[doc = ""]
#[doc = " Get a pointer to this structure through ::OrtGetApiBase"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct OrtApiBase {
    #[doc = " \\brief Get a pointer to the requested version of the ::OrtApi"]
    #[doc = ""]
    #[doc = " \\param[in] version Must be ::ORT_API_VERSION"]
    #[doc = " \\return The ::OrtApi for the version requested, nullptr will be returned if this version is unsupported, for example when using a runtime"]
    #[doc = "   older than the version created with this header file."]
    pub GetApi: ::std::option::Option<unsafe extern "stdcall" fn(version: u32) -> *const OrtApi>,
    #[doc = "< Returns a null terminated string of the version of the Onnxruntime library (eg: \"1.8.1\")"]
    pub GetVersionString:
        ::std::option::Option<unsafe extern "stdcall" fn() -> *const ::std::os::raw::c_char>,
}
#[test]
fn bindgen_test_layout_OrtApiBase() {
    assert_eq!(
        ::std::mem::size_of::<OrtApiBase>(),
        8usize,
        concat!("Size of: ", stringify!(OrtApiBase))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtApiBase>(),
        4usize,
        concat!("Alignment of ", stringify!(OrtApiBase))
    );
    fn test_field_GetApi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApiBase>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetApi) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApiBase),
                "::",
                stringify!(GetApi)
            )
        );
    }
    test_field_GetApi();
    fn test_field_GetVersionString() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApiBase>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetVersionString) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApiBase),
                "::",
                stringify!(GetVersionString)
            )
        );
    }
    test_field_GetVersionString();
}
extern "stdcall" {
    #[doc = " \\brief The Onnxruntime library's entry point to access the C API"]
    #[doc = ""]
    #[doc = " Call this to get the a pointer to an ::OrtApiBase"]
    pub fn OrtGetApiBase() -> *const OrtApiBase;
}
#[doc = " \\brief Thread work loop function"]
#[doc = ""]
#[doc = " Onnxruntime will provide the working loop on custom thread creation"]
#[doc = " Argument is an onnxruntime built-in type which will be provided when thread pool calls OrtCustomCreateThreadFn"]
pub type OrtThreadWorkerFn =
    ::std::option::Option<unsafe extern "C" fn(ort_worker_fn_param: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OrtCustomHandleType {
    pub __place_holder: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_OrtCustomHandleType() {
    assert_eq!(
        ::std::mem::size_of::<OrtCustomHandleType>(),
        1usize,
        concat!("Size of: ", stringify!(OrtCustomHandleType))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtCustomHandleType>(),
        1usize,
        concat!("Alignment of ", stringify!(OrtCustomHandleType))
    );
    fn test_field___place_holder() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtCustomHandleType>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).__place_holder) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtCustomHandleType),
                "::",
                stringify!(__place_holder)
            )
        );
    }
    test_field___place_holder();
}
pub type OrtCustomThreadHandle = *const OrtCustomHandleType;
#[doc = " \\brief Ort custom thread creation function"]
#[doc = ""]
#[doc = " The function should return a thread handle to be used in onnxruntime thread pools"]
#[doc = " Onnxruntime will throw exception on return value of nullptr or 0, indicating that the function failed to create a thread"]
pub type OrtCustomCreateThreadFn = ::std::option::Option<
    unsafe extern "C" fn(
        ort_custom_thread_creation_options: *mut ::std::os::raw::c_void,
        ort_thread_worker_fn: OrtThreadWorkerFn,
        ort_worker_fn_param: *mut ::std::os::raw::c_void,
    ) -> OrtCustomThreadHandle,
>;
#[doc = " \\brief Custom thread join function"]
#[doc = ""]
#[doc = " Onnxruntime thread pool destructor will call the function to join a custom thread."]
#[doc = " Argument ort_custom_thread_handle is the value returned by OrtCustomCreateThreadFn"]
pub type OrtCustomJoinThreadFn =
    ::std::option::Option<unsafe extern "C" fn(ort_custom_thread_handle: OrtCustomThreadHandle)>;
#[doc = " \\brief The C API"]
#[doc = ""]
#[doc = " All C API functions are defined inside this structure as pointers to functions."]
#[doc = " Call OrtApiBase::GetApi to get a pointer to it"]
#[doc = ""]
#[doc = " \\nosubgrouping"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct OrtApi {
    #[doc = " \\brief Create an OrtStatus from a null terminated string"]
    #[doc = ""]
    #[doc = " \\param[in] code"]
    #[doc = " \\param[in] msg A null-terminated string. Its contents will be copied."]
    #[doc = " \\return A new OrtStatus object, must be destroyed with OrtApi::ReleaseStatus"]
    pub CreateStatus: ::std::option::Option<
        unsafe extern "stdcall" fn(
            code: OrtErrorCode,
            msg: *const ::std::os::raw::c_char,
        ) -> *mut OrtStatus,
    >,
    #[doc = " \\brief Get OrtErrorCode from OrtStatus"]
    #[doc = ""]
    #[doc = " \\param[in] status"]
    #[doc = " \\return OrtErrorCode that \\p status was created with"]
    pub GetErrorCode:
        ::std::option::Option<unsafe extern "stdcall" fn(status: *const OrtStatus) -> OrtErrorCode>,
    #[doc = " \\brief Get error string from OrtStatus"]
    #[doc = ""]
    #[doc = " \\param[in] status"]
    #[doc = " \\return The error message inside the `status`. Do not free the returned value."]
    pub GetErrorMessage: ::std::option::Option<
        unsafe extern "stdcall" fn(status: *const OrtStatus) -> *const ::std::os::raw::c_char,
    >,
    pub CreateEnv: ::std::option::Option<
        unsafe extern "stdcall" fn(
            log_severity_level: OrtLoggingLevel,
            logid: *const ::std::os::raw::c_char,
            out: *mut *mut OrtEnv,
        ) -> OrtStatusPtr,
    >,
    pub CreateEnvWithCustomLogger: ::std::option::Option<
        unsafe extern "stdcall" fn(
            logging_function: OrtLoggingFunction,
            logger_param: *mut ::std::os::raw::c_void,
            log_severity_level: OrtLoggingLevel,
            logid: *const ::std::os::raw::c_char,
            out: *mut *mut OrtEnv,
        ) -> OrtStatusPtr,
    >,
    pub EnableTelemetryEvents:
        ::std::option::Option<unsafe extern "stdcall" fn(env: *const OrtEnv) -> OrtStatusPtr>,
    pub DisableTelemetryEvents:
        ::std::option::Option<unsafe extern "stdcall" fn(env: *const OrtEnv) -> OrtStatusPtr>,
    pub CreateSession: ::std::option::Option<
        unsafe extern "stdcall" fn(
            env: *const OrtEnv,
            model_path: *const wchar_t,
            options: *const OrtSessionOptions,
            out: *mut *mut OrtSession,
        ) -> OrtStatusPtr,
    >,
    pub CreateSessionFromArray: ::std::option::Option<
        unsafe extern "stdcall" fn(
            env: *const OrtEnv,
            model_data: *const ::std::os::raw::c_void,
            model_data_length: usize,
            options: *const OrtSessionOptions,
            out: *mut *mut OrtSession,
        ) -> OrtStatusPtr,
    >,
    pub Run: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *mut OrtSession,
            run_options: *const OrtRunOptions,
            input_names: *const *const ::std::os::raw::c_char,
            inputs: *const *const OrtValue,
            input_len: usize,
            output_names: *const *const ::std::os::raw::c_char,
            output_names_len: usize,
            outputs: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub CreateSessionOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut *mut OrtSessionOptions) -> OrtStatusPtr,
    >,
    pub SetOptimizedModelFilePath: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            optimized_model_filepath: *const wchar_t,
        ) -> OrtStatusPtr,
    >,
    pub CloneSessionOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(
            in_options: *const OrtSessionOptions,
            out_options: *mut *mut OrtSessionOptions,
        ) -> OrtStatusPtr,
    >,
    pub SetSessionExecutionMode: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            execution_mode: ExecutionMode,
        ) -> OrtStatusPtr,
    >,
    pub EnableProfiling: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            profile_file_prefix: *const wchar_t,
        ) -> OrtStatusPtr,
    >,
    pub DisableProfiling: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtSessionOptions) -> OrtStatusPtr,
    >,
    pub EnableMemPattern: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtSessionOptions) -> OrtStatusPtr,
    >,
    pub DisableMemPattern: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtSessionOptions) -> OrtStatusPtr,
    >,
    pub EnableCpuMemArena: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtSessionOptions) -> OrtStatusPtr,
    >,
    pub DisableCpuMemArena: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtSessionOptions) -> OrtStatusPtr,
    >,
    pub SetSessionLogId: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            logid: *const ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub SetSessionLogVerbosityLevel: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            session_log_verbosity_level: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub SetSessionLogSeverityLevel: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            session_log_severity_level: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub SetSessionGraphOptimizationLevel: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            graph_optimization_level: GraphOptimizationLevel,
        ) -> OrtStatusPtr,
    >,
    pub SetIntraOpNumThreads: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            intra_op_num_threads: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub SetInterOpNumThreads: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            inter_op_num_threads: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub CreateCustomOpDomain: ::std::option::Option<
        unsafe extern "stdcall" fn(
            domain: *const ::std::os::raw::c_char,
            out: *mut *mut OrtCustomOpDomain,
        ) -> OrtStatusPtr,
    >,
    pub CustomOpDomain_Add: ::std::option::Option<
        unsafe extern "stdcall" fn(
            custom_op_domain: *mut OrtCustomOpDomain,
            op: *const OrtCustomOp,
        ) -> OrtStatusPtr,
    >,
    pub AddCustomOpDomain: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            custom_op_domain: *mut OrtCustomOpDomain,
        ) -> OrtStatusPtr,
    >,
    pub RegisterCustomOpsLibrary: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            library_path: *const ::std::os::raw::c_char,
            library_handle: *mut *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub SessionGetInputCount: ::std::option::Option<
        unsafe extern "stdcall" fn(session: *const OrtSession, out: *mut usize) -> OrtStatusPtr,
    >,
    pub SessionGetOutputCount: ::std::option::Option<
        unsafe extern "stdcall" fn(session: *const OrtSession, out: *mut usize) -> OrtStatusPtr,
    >,
    pub SessionGetOverridableInitializerCount: ::std::option::Option<
        unsafe extern "stdcall" fn(session: *const OrtSession, out: *mut usize) -> OrtStatusPtr,
    >,
    pub SessionGetInputTypeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *const OrtSession,
            index: usize,
            type_info: *mut *mut OrtTypeInfo,
        ) -> OrtStatusPtr,
    >,
    pub SessionGetOutputTypeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *const OrtSession,
            index: usize,
            type_info: *mut *mut OrtTypeInfo,
        ) -> OrtStatusPtr,
    >,
    pub SessionGetOverridableInitializerTypeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *const OrtSession,
            index: usize,
            type_info: *mut *mut OrtTypeInfo,
        ) -> OrtStatusPtr,
    >,
    pub SessionGetInputName: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *const OrtSession,
            index: usize,
            allocator: *mut OrtAllocator,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub SessionGetOutputName: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *const OrtSession,
            index: usize,
            allocator: *mut OrtAllocator,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub SessionGetOverridableInitializerName: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *const OrtSession,
            index: usize,
            allocator: *mut OrtAllocator,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub CreateRunOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(out: *mut *mut OrtRunOptions) -> OrtStatusPtr,
    >,
    pub RunOptionsSetRunLogVerbosityLevel: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtRunOptions,
            log_verbosity_level: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub RunOptionsSetRunLogSeverityLevel: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtRunOptions,
            log_severity_level: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub RunOptionsSetRunTag: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtRunOptions,
            run_tag: *const ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub RunOptionsGetRunLogVerbosityLevel: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *const OrtRunOptions,
            log_verbosity_level: *mut ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub RunOptionsGetRunLogSeverityLevel: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *const OrtRunOptions,
            log_severity_level: *mut ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub RunOptionsGetRunTag: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *const OrtRunOptions,
            run_tag: *mut *const ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub RunOptionsSetTerminate: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtRunOptions) -> OrtStatusPtr,
    >,
    pub RunOptionsUnsetTerminate: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtRunOptions) -> OrtStatusPtr,
    >,
    pub CreateTensorAsOrtValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            allocator: *mut OrtAllocator,
            shape: *const i64,
            shape_len: usize,
            type_: ONNXTensorElementDataType,
            out: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub CreateTensorWithDataAsOrtValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtMemoryInfo,
            p_data: *mut ::std::os::raw::c_void,
            p_data_len: usize,
            shape: *const i64,
            shape_len: usize,
            type_: ONNXTensorElementDataType,
            out: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub IsTensor: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            out: *mut ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub GetTensorMutableData: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *mut OrtValue,
            out: *mut *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub FillStringTensor: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *mut OrtValue,
            s: *const *const ::std::os::raw::c_char,
            s_len: usize,
        ) -> OrtStatusPtr,
    >,
    pub GetStringTensorDataLength: ::std::option::Option<
        unsafe extern "stdcall" fn(value: *const OrtValue, len: *mut usize) -> OrtStatusPtr,
    >,
    pub GetStringTensorContent: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            s: *mut ::std::os::raw::c_void,
            s_len: usize,
            offsets: *mut usize,
            offsets_len: usize,
        ) -> OrtStatusPtr,
    >,
    pub CastTypeInfoToTensorInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            type_info: *const OrtTypeInfo,
            out: *mut *const OrtTensorTypeAndShapeInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetOnnxTypeFromTypeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            type_info: *const OrtTypeInfo,
            out: *mut ONNXType,
        ) -> OrtStatusPtr,
    >,
    pub CreateTensorTypeAndShapeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(out: *mut *mut OrtTensorTypeAndShapeInfo) -> OrtStatusPtr,
    >,
    pub SetTensorElementType: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *mut OrtTensorTypeAndShapeInfo,
            type_: ONNXTensorElementDataType,
        ) -> OrtStatusPtr,
    >,
    pub SetDimensions: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *mut OrtTensorTypeAndShapeInfo,
            dim_values: *const i64,
            dim_count: usize,
        ) -> OrtStatusPtr,
    >,
    pub GetTensorElementType: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtTensorTypeAndShapeInfo,
            out: *mut ONNXTensorElementDataType,
        ) -> OrtStatusPtr,
    >,
    pub GetDimensionsCount: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtTensorTypeAndShapeInfo,
            out: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub GetDimensions: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtTensorTypeAndShapeInfo,
            dim_values: *mut i64,
            dim_values_length: usize,
        ) -> OrtStatusPtr,
    >,
    pub GetSymbolicDimensions: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtTensorTypeAndShapeInfo,
            dim_params: *mut *const ::std::os::raw::c_char,
            dim_params_length: usize,
        ) -> OrtStatusPtr,
    >,
    pub GetTensorShapeElementCount: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtTensorTypeAndShapeInfo,
            out: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub GetTensorTypeAndShape: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            out: *mut *mut OrtTensorTypeAndShapeInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetTypeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            out: *mut *mut OrtTypeInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetValueType: ::std::option::Option<
        unsafe extern "stdcall" fn(value: *const OrtValue, out: *mut ONNXType) -> OrtStatusPtr,
    >,
    pub CreateMemoryInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            name: *const ::std::os::raw::c_char,
            type_: OrtAllocatorType,
            id: ::std::os::raw::c_int,
            mem_type: OrtMemType,
            out: *mut *mut OrtMemoryInfo,
        ) -> OrtStatusPtr,
    >,
    pub CreateCpuMemoryInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            type_: OrtAllocatorType,
            mem_type: OrtMemType,
            out: *mut *mut OrtMemoryInfo,
        ) -> OrtStatusPtr,
    >,
    pub CompareMemoryInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info1: *const OrtMemoryInfo,
            info2: *const OrtMemoryInfo,
            out: *mut ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub MemoryInfoGetName: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ptr: *const OrtMemoryInfo,
            out: *mut *const ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub MemoryInfoGetId: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ptr: *const OrtMemoryInfo,
            out: *mut ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub MemoryInfoGetMemType: ::std::option::Option<
        unsafe extern "stdcall" fn(ptr: *const OrtMemoryInfo, out: *mut OrtMemType) -> OrtStatusPtr,
    >,
    pub MemoryInfoGetType: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ptr: *const OrtMemoryInfo,
            out: *mut OrtAllocatorType,
        ) -> OrtStatusPtr,
    >,
    pub AllocatorAlloc: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_allocator: *mut OrtAllocator,
            size: usize,
            out: *mut *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub AllocatorFree: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_allocator: *mut OrtAllocator,
            p: *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub AllocatorGetInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_allocator: *const OrtAllocator,
            out: *mut *const OrtMemoryInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetAllocatorWithDefaultOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(out: *mut *mut OrtAllocator) -> OrtStatusPtr,
    >,
    pub AddFreeDimensionOverride: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            dim_denotation: *const ::std::os::raw::c_char,
            dim_value: i64,
        ) -> OrtStatusPtr,
    >,
    pub GetValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            index: ::std::os::raw::c_int,
            allocator: *mut OrtAllocator,
            out: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub GetValueCount: ::std::option::Option<
        unsafe extern "stdcall" fn(value: *const OrtValue, out: *mut usize) -> OrtStatusPtr,
    >,
    pub CreateValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            in_: *const *const OrtValue,
            num_values: usize,
            value_type: ONNXType,
            out: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub CreateOpaqueValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            domain_name: *const ::std::os::raw::c_char,
            type_name: *const ::std::os::raw::c_char,
            data_container: *const ::std::os::raw::c_void,
            data_container_size: usize,
            out: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub GetOpaqueValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            domain_name: *const ::std::os::raw::c_char,
            type_name: *const ::std::os::raw::c_char,
            in_: *const OrtValue,
            data_container: *mut ::std::os::raw::c_void,
            data_container_size: usize,
        ) -> OrtStatusPtr,
    >,
    pub KernelInfoGetAttribute_float: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtKernelInfo,
            name: *const ::std::os::raw::c_char,
            out: *mut f32,
        ) -> OrtStatusPtr,
    >,
    pub KernelInfoGetAttribute_int64: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtKernelInfo,
            name: *const ::std::os::raw::c_char,
            out: *mut i64,
        ) -> OrtStatusPtr,
    >,
    pub KernelInfoGetAttribute_string: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtKernelInfo,
            name: *const ::std::os::raw::c_char,
            out: *mut ::std::os::raw::c_char,
            size: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub KernelContext_GetInputCount: ::std::option::Option<
        unsafe extern "stdcall" fn(
            context: *const OrtKernelContext,
            out: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub KernelContext_GetOutputCount: ::std::option::Option<
        unsafe extern "stdcall" fn(
            context: *const OrtKernelContext,
            out: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub KernelContext_GetInput: ::std::option::Option<
        unsafe extern "stdcall" fn(
            context: *const OrtKernelContext,
            index: usize,
            out: *mut *const OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub KernelContext_GetOutput: ::std::option::Option<
        unsafe extern "stdcall" fn(
            context: *mut OrtKernelContext,
            index: usize,
            dim_values: *const i64,
            dim_count: usize,
            out: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub ReleaseEnv: ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtEnv)>,
    pub ReleaseStatus: ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtStatus)>,
    pub ReleaseMemoryInfo:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtMemoryInfo)>,
    pub ReleaseSession: ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtSession)>,
    pub ReleaseValue: ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtValue)>,
    pub ReleaseRunOptions:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtRunOptions)>,
    pub ReleaseTypeInfo: ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtTypeInfo)>,
    pub ReleaseTensorTypeAndShapeInfo:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtTensorTypeAndShapeInfo)>,
    pub ReleaseSessionOptions:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtSessionOptions)>,
    pub ReleaseCustomOpDomain:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtCustomOpDomain)>,
    pub GetDenotationFromTypeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            type_info: *const OrtTypeInfo,
            denotation: *mut *const ::std::os::raw::c_char,
            len: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub CastTypeInfoToMapTypeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            type_info: *const OrtTypeInfo,
            out: *mut *const OrtMapTypeInfo,
        ) -> OrtStatusPtr,
    >,
    pub CastTypeInfoToSequenceTypeInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            type_info: *const OrtTypeInfo,
            out: *mut *const OrtSequenceTypeInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetMapKeyType: ::std::option::Option<
        unsafe extern "stdcall" fn(
            map_type_info: *const OrtMapTypeInfo,
            out: *mut ONNXTensorElementDataType,
        ) -> OrtStatusPtr,
    >,
    pub GetMapValueType: ::std::option::Option<
        unsafe extern "stdcall" fn(
            map_type_info: *const OrtMapTypeInfo,
            type_info: *mut *mut OrtTypeInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetSequenceElementType: ::std::option::Option<
        unsafe extern "stdcall" fn(
            sequence_type_info: *const OrtSequenceTypeInfo,
            type_info: *mut *mut OrtTypeInfo,
        ) -> OrtStatusPtr,
    >,
    pub ReleaseMapTypeInfo:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtMapTypeInfo)>,
    pub ReleaseSequenceTypeInfo:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtSequenceTypeInfo)>,
    pub SessionEndProfiling: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *mut OrtSession,
            allocator: *mut OrtAllocator,
            out: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub SessionGetModelMetadata: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *const OrtSession,
            out: *mut *mut OrtModelMetadata,
        ) -> OrtStatusPtr,
    >,
    pub ModelMetadataGetProducerName: ::std::option::Option<
        unsafe extern "stdcall" fn(
            model_metadata: *const OrtModelMetadata,
            allocator: *mut OrtAllocator,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub ModelMetadataGetGraphName: ::std::option::Option<
        unsafe extern "stdcall" fn(
            model_metadata: *const OrtModelMetadata,
            allocator: *mut OrtAllocator,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub ModelMetadataGetDomain: ::std::option::Option<
        unsafe extern "stdcall" fn(
            model_metadata: *const OrtModelMetadata,
            allocator: *mut OrtAllocator,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub ModelMetadataGetDescription: ::std::option::Option<
        unsafe extern "stdcall" fn(
            model_metadata: *const OrtModelMetadata,
            allocator: *mut OrtAllocator,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub ModelMetadataLookupCustomMetadataMap: ::std::option::Option<
        unsafe extern "stdcall" fn(
            model_metadata: *const OrtModelMetadata,
            allocator: *mut OrtAllocator,
            key: *const ::std::os::raw::c_char,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub ModelMetadataGetVersion: ::std::option::Option<
        unsafe extern "stdcall" fn(
            model_metadata: *const OrtModelMetadata,
            value: *mut i64,
        ) -> OrtStatusPtr,
    >,
    pub ReleaseModelMetadata:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtModelMetadata)>,
    pub CreateEnvWithGlobalThreadPools: ::std::option::Option<
        unsafe extern "stdcall" fn(
            log_severity_level: OrtLoggingLevel,
            logid: *const ::std::os::raw::c_char,
            tp_options: *const OrtThreadingOptions,
            out: *mut *mut OrtEnv,
        ) -> OrtStatusPtr,
    >,
    pub DisablePerSessionThreads: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtSessionOptions) -> OrtStatusPtr,
    >,
    pub CreateThreadingOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(out: *mut *mut OrtThreadingOptions) -> OrtStatusPtr,
    >,
    pub ReleaseThreadingOptions:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtThreadingOptions)>,
    pub ModelMetadataGetCustomMetadataMapKeys: ::std::option::Option<
        unsafe extern "stdcall" fn(
            model_metadata: *const OrtModelMetadata,
            allocator: *mut OrtAllocator,
            keys: *mut *mut *mut ::std::os::raw::c_char,
            num_keys: *mut i64,
        ) -> OrtStatusPtr,
    >,
    pub AddFreeDimensionOverrideByName: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            dim_name: *const ::std::os::raw::c_char,
            dim_value: i64,
        ) -> OrtStatusPtr,
    >,
    pub GetAvailableProviders: ::std::option::Option<
        unsafe extern "stdcall" fn(
            out_ptr: *mut *mut *mut ::std::os::raw::c_char,
            provider_length: *mut ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub ReleaseAvailableProviders: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ptr: *mut *mut ::std::os::raw::c_char,
            providers_length: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub GetStringTensorElementLength: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            index: usize,
            out: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub GetStringTensorElement: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            s_len: usize,
            index: usize,
            s: *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub FillStringTensorElement: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *mut OrtValue,
            s: *const ::std::os::raw::c_char,
            index: usize,
        ) -> OrtStatusPtr,
    >,
    pub AddSessionConfigEntry: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            config_key: *const ::std::os::raw::c_char,
            config_value: *const ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub CreateAllocator: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *const OrtSession,
            mem_info: *const OrtMemoryInfo,
            out: *mut *mut OrtAllocator,
        ) -> OrtStatusPtr,
    >,
    pub ReleaseAllocator:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtAllocator)>,
    pub RunWithBinding: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *mut OrtSession,
            run_options: *const OrtRunOptions,
            binding_ptr: *const OrtIoBinding,
        ) -> OrtStatusPtr,
    >,
    pub CreateIoBinding: ::std::option::Option<
        unsafe extern "stdcall" fn(
            session: *mut OrtSession,
            out: *mut *mut OrtIoBinding,
        ) -> OrtStatusPtr,
    >,
    pub ReleaseIoBinding:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtIoBinding)>,
    pub BindInput: ::std::option::Option<
        unsafe extern "stdcall" fn(
            binding_ptr: *mut OrtIoBinding,
            name: *const ::std::os::raw::c_char,
            val_ptr: *const OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub BindOutput: ::std::option::Option<
        unsafe extern "stdcall" fn(
            binding_ptr: *mut OrtIoBinding,
            name: *const ::std::os::raw::c_char,
            val_ptr: *const OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub BindOutputToDevice: ::std::option::Option<
        unsafe extern "stdcall" fn(
            binding_ptr: *mut OrtIoBinding,
            name: *const ::std::os::raw::c_char,
            mem_info_ptr: *const OrtMemoryInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetBoundOutputNames: ::std::option::Option<
        unsafe extern "stdcall" fn(
            binding_ptr: *const OrtIoBinding,
            allocator: *mut OrtAllocator,
            buffer: *mut *mut ::std::os::raw::c_char,
            lengths: *mut *mut usize,
            count: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub GetBoundOutputValues: ::std::option::Option<
        unsafe extern "stdcall" fn(
            binding_ptr: *const OrtIoBinding,
            allocator: *mut OrtAllocator,
            output: *mut *mut *mut OrtValue,
            output_count: *mut usize,
        ) -> OrtStatusPtr,
    >,
    #[doc = " \\brief Clears any previously set Inputs for an ::OrtIoBinding"]
    pub ClearBoundInputs:
        ::std::option::Option<unsafe extern "stdcall" fn(binding_ptr: *mut OrtIoBinding)>,
    #[doc = " \\brief Clears any previously set Outputs for an ::OrtIoBinding"]
    pub ClearBoundOutputs:
        ::std::option::Option<unsafe extern "stdcall" fn(binding_ptr: *mut OrtIoBinding)>,
    pub TensorAt: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *mut OrtValue,
            location_values: *const i64,
            location_values_count: usize,
            out: *mut *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub CreateAndRegisterAllocator: ::std::option::Option<
        unsafe extern "stdcall" fn(
            env: *mut OrtEnv,
            mem_info: *const OrtMemoryInfo,
            arena_cfg: *const OrtArenaCfg,
        ) -> OrtStatusPtr,
    >,
    pub SetLanguageProjection: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_env: *const OrtEnv,
            projection: OrtLanguageProjection,
        ) -> OrtStatusPtr,
    >,
    pub SessionGetProfilingStartTimeNs: ::std::option::Option<
        unsafe extern "stdcall" fn(session: *const OrtSession, out: *mut u64) -> OrtStatusPtr,
    >,
    pub SetGlobalIntraOpNumThreads: ::std::option::Option<
        unsafe extern "stdcall" fn(
            tp_options: *mut OrtThreadingOptions,
            intra_op_num_threads: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub SetGlobalInterOpNumThreads: ::std::option::Option<
        unsafe extern "stdcall" fn(
            tp_options: *mut OrtThreadingOptions,
            inter_op_num_threads: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub SetGlobalSpinControl: ::std::option::Option<
        unsafe extern "stdcall" fn(
            tp_options: *mut OrtThreadingOptions,
            allow_spinning: ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub AddInitializer: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            name: *const ::std::os::raw::c_char,
            val: *const OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub CreateEnvWithCustomLoggerAndGlobalThreadPools: ::std::option::Option<
        unsafe extern "stdcall" fn(
            logging_function: OrtLoggingFunction,
            logger_param: *mut ::std::os::raw::c_void,
            log_severity_level: OrtLoggingLevel,
            logid: *const ::std::os::raw::c_char,
            tp_options: *const OrtThreadingOptions,
            out: *mut *mut OrtEnv,
        ) -> OrtStatusPtr,
    >,
    pub SessionOptionsAppendExecutionProvider_CUDA: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            cuda_options: *const OrtCUDAProviderOptions,
        ) -> OrtStatusPtr,
    >,
    pub SessionOptionsAppendExecutionProvider_ROCM: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            rocm_options: *const OrtROCMProviderOptions,
        ) -> OrtStatusPtr,
    >,
    pub SessionOptionsAppendExecutionProvider_OpenVINO: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            provider_options: *const OrtOpenVINOProviderOptions,
        ) -> OrtStatusPtr,
    >,
    pub SetGlobalDenormalAsZero: ::std::option::Option<
        unsafe extern "stdcall" fn(tp_options: *mut OrtThreadingOptions) -> OrtStatusPtr,
    >,
    pub CreateArenaCfg: ::std::option::Option<
        unsafe extern "stdcall" fn(
            max_mem: usize,
            arena_extend_strategy: ::std::os::raw::c_int,
            initial_chunk_size_bytes: ::std::os::raw::c_int,
            max_dead_bytes_per_chunk: ::std::os::raw::c_int,
            out: *mut *mut OrtArenaCfg,
        ) -> OrtStatusPtr,
    >,
    pub ReleaseArenaCfg: ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtArenaCfg)>,
    pub ModelMetadataGetGraphDescription: ::std::option::Option<
        unsafe extern "stdcall" fn(
            model_metadata: *const OrtModelMetadata,
            allocator: *mut OrtAllocator,
            value: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub SessionOptionsAppendExecutionProvider_TensorRT: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            tensorrt_options: *const OrtTensorRTProviderOptions,
        ) -> OrtStatusPtr,
    >,
    pub SetCurrentGpuDeviceId: ::std::option::Option<
        unsafe extern "stdcall" fn(device_id: ::std::os::raw::c_int) -> OrtStatusPtr,
    >,
    pub GetCurrentGpuDeviceId: ::std::option::Option<
        unsafe extern "stdcall" fn(device_id: *mut ::std::os::raw::c_int) -> OrtStatusPtr,
    >,
    pub KernelInfoGetAttributeArray_float: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtKernelInfo,
            name: *const ::std::os::raw::c_char,
            out: *mut f32,
            size: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub KernelInfoGetAttributeArray_int64: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtKernelInfo,
            name: *const ::std::os::raw::c_char,
            out: *mut i64,
            size: *mut usize,
        ) -> OrtStatusPtr,
    >,
    pub CreateArenaCfgV2: ::std::option::Option<
        unsafe extern "stdcall" fn(
            arena_config_keys: *const *const ::std::os::raw::c_char,
            arena_config_values: *const usize,
            num_keys: usize,
            out: *mut *mut OrtArenaCfg,
        ) -> OrtStatusPtr,
    >,
    pub AddRunConfigEntry: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtRunOptions,
            config_key: *const ::std::os::raw::c_char,
            config_value: *const ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    pub CreatePrepackedWeightsContainer: ::std::option::Option<
        unsafe extern "stdcall" fn(out: *mut *mut OrtPrepackedWeightsContainer) -> OrtStatusPtr,
    >,
    pub ReleasePrepackedWeightsContainer:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtPrepackedWeightsContainer)>,
    pub CreateSessionWithPrepackedWeightsContainer: ::std::option::Option<
        unsafe extern "stdcall" fn(
            env: *const OrtEnv,
            model_path: *const wchar_t,
            options: *const OrtSessionOptions,
            prepacked_weights_container: *mut OrtPrepackedWeightsContainer,
            out: *mut *mut OrtSession,
        ) -> OrtStatusPtr,
    >,
    pub CreateSessionFromArrayWithPrepackedWeightsContainer: ::std::option::Option<
        unsafe extern "stdcall" fn(
            env: *const OrtEnv,
            model_data: *const ::std::os::raw::c_void,
            model_data_length: usize,
            options: *const OrtSessionOptions,
            prepacked_weights_container: *mut OrtPrepackedWeightsContainer,
            out: *mut *mut OrtSession,
        ) -> OrtStatusPtr,
    >,
    pub SessionOptionsAppendExecutionProvider_TensorRT_V2: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            tensorrt_options: *const OrtTensorRTProviderOptionsV2,
        ) -> OrtStatusPtr,
    >,
    pub CreateTensorRTProviderOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(out: *mut *mut OrtTensorRTProviderOptionsV2) -> OrtStatusPtr,
    >,
    pub UpdateTensorRTProviderOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(
            tensorrt_options: *mut OrtTensorRTProviderOptionsV2,
            provider_options_keys: *const *const ::std::os::raw::c_char,
            provider_options_values: *const *const ::std::os::raw::c_char,
            num_keys: usize,
        ) -> OrtStatusPtr,
    >,
    pub GetTensorRTProviderOptionsAsString: ::std::option::Option<
        unsafe extern "stdcall" fn(
            tensorrt_options: *const OrtTensorRTProviderOptionsV2,
            allocator: *mut OrtAllocator,
            ptr: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    #[doc = " \\brief Release an ::OrtTensorRTProviderOptionsV2"]
    #[doc = ""]
    #[doc = " \\note This is an exception in the naming convention of other Release* functions, as the name of the method does not have the V2 suffix, but the type does"]
    pub ReleaseTensorRTProviderOptions:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtTensorRTProviderOptionsV2)>,
    pub EnableOrtCustomOps: ::std::option::Option<
        unsafe extern "stdcall" fn(options: *mut OrtSessionOptions) -> OrtStatusPtr,
    >,
    pub RegisterAllocator: ::std::option::Option<
        unsafe extern "stdcall" fn(env: *mut OrtEnv, allocator: *mut OrtAllocator) -> OrtStatusPtr,
    >,
    pub UnregisterAllocator: ::std::option::Option<
        unsafe extern "stdcall" fn(
            env: *mut OrtEnv,
            mem_info: *const OrtMemoryInfo,
        ) -> OrtStatusPtr,
    >,
    pub IsSparseTensor: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            out: *mut ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub CreateSparseTensorAsOrtValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            allocator: *mut OrtAllocator,
            dense_shape: *const i64,
            dense_shape_len: usize,
            type_: ONNXTensorElementDataType,
            out: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub FillSparseTensorCoo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *mut OrtValue,
            data_mem_info: *const OrtMemoryInfo,
            values_shape: *const i64,
            values_shape_len: usize,
            values: *const ::std::os::raw::c_void,
            indices_data: *const i64,
            indices_num: usize,
        ) -> OrtStatusPtr,
    >,
    pub FillSparseTensorCsr: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *mut OrtValue,
            data_mem_info: *const OrtMemoryInfo,
            values_shape: *const i64,
            values_shape_len: usize,
            values: *const ::std::os::raw::c_void,
            inner_indices_data: *const i64,
            inner_indices_num: usize,
            outer_indices_data: *const i64,
            outer_indices_num: usize,
        ) -> OrtStatusPtr,
    >,
    pub FillSparseTensorBlockSparse: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *mut OrtValue,
            data_mem_info: *const OrtMemoryInfo,
            values_shape: *const i64,
            values_shape_len: usize,
            values: *const ::std::os::raw::c_void,
            indices_shape_data: *const i64,
            indices_shape_len: usize,
            indices_data: *const i32,
        ) -> OrtStatusPtr,
    >,
    pub CreateSparseTensorWithValuesAsOrtValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            info: *const OrtMemoryInfo,
            p_data: *mut ::std::os::raw::c_void,
            dense_shape: *const i64,
            dense_shape_len: usize,
            values_shape: *const i64,
            values_shape_len: usize,
            type_: ONNXTensorElementDataType,
            out: *mut *mut OrtValue,
        ) -> OrtStatusPtr,
    >,
    pub UseCooIndices: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *mut OrtValue,
            indices_data: *mut i64,
            indices_num: usize,
        ) -> OrtStatusPtr,
    >,
    pub UseCsrIndices: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *mut OrtValue,
            inner_data: *mut i64,
            inner_num: usize,
            outer_data: *mut i64,
            outer_num: usize,
        ) -> OrtStatusPtr,
    >,
    pub UseBlockSparseIndices: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *mut OrtValue,
            indices_shape: *const i64,
            indices_shape_len: usize,
            indices_data: *mut i32,
        ) -> OrtStatusPtr,
    >,
    pub GetSparseTensorFormat: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *const OrtValue,
            out: *mut OrtSparseFormat,
        ) -> OrtStatusPtr,
    >,
    pub GetSparseTensorValuesTypeAndShape: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *const OrtValue,
            out: *mut *mut OrtTensorTypeAndShapeInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetSparseTensorValues: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *const OrtValue,
            out: *mut *const ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub GetSparseTensorIndicesTypeShape: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *const OrtValue,
            indices_format: OrtSparseIndicesFormat,
            out: *mut *mut OrtTensorTypeAndShapeInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetSparseTensorIndices: ::std::option::Option<
        unsafe extern "stdcall" fn(
            ort_value: *const OrtValue,
            indices_format: OrtSparseIndicesFormat,
            num_indices: *mut usize,
            indices: *mut *const ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub HasValue: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            out: *mut ::std::os::raw::c_int,
        ) -> OrtStatusPtr,
    >,
    pub KernelContext_GetGPUComputeStream: ::std::option::Option<
        unsafe extern "stdcall" fn(
            context: *const OrtKernelContext,
            out: *mut *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub GetTensorMemoryInfo: ::std::option::Option<
        unsafe extern "stdcall" fn(
            value: *const OrtValue,
            mem_info: *mut *const OrtMemoryInfo,
        ) -> OrtStatusPtr,
    >,
    pub GetExecutionProviderApi: ::std::option::Option<
        unsafe extern "stdcall" fn(
            provider_name: *const ::std::os::raw::c_char,
            version: u32,
            provider_api: *mut *const ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub SessionOptionsSetCustomCreateThreadFn: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            ort_custom_create_thread_fn: OrtCustomCreateThreadFn,
        ) -> OrtStatusPtr,
    >,
    pub SessionOptionsSetCustomThreadCreationOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            ort_custom_thread_creation_options: *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub SessionOptionsSetCustomJoinThreadFn: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            ort_custom_join_thread_fn: OrtCustomJoinThreadFn,
        ) -> OrtStatusPtr,
    >,
    pub SetGlobalCustomCreateThreadFn: ::std::option::Option<
        unsafe extern "stdcall" fn(
            tp_options: *mut OrtThreadingOptions,
            ort_custom_create_thread_fn: OrtCustomCreateThreadFn,
        ) -> OrtStatusPtr,
    >,
    pub SetGlobalCustomThreadCreationOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(
            tp_options: *mut OrtThreadingOptions,
            ort_custom_thread_creation_options: *mut ::std::os::raw::c_void,
        ) -> OrtStatusPtr,
    >,
    pub SetGlobalCustomJoinThreadFn: ::std::option::Option<
        unsafe extern "stdcall" fn(
            tp_options: *mut OrtThreadingOptions,
            ort_custom_join_thread_fn: OrtCustomJoinThreadFn,
        ) -> OrtStatusPtr,
    >,
    pub SynchronizeBoundInputs: ::std::option::Option<
        unsafe extern "stdcall" fn(binding_ptr: *mut OrtIoBinding) -> OrtStatusPtr,
    >,
    pub SynchronizeBoundOutputs: ::std::option::Option<
        unsafe extern "stdcall" fn(binding_ptr: *mut OrtIoBinding) -> OrtStatusPtr,
    >,
    pub SessionOptionsAppendExecutionProvider_CUDA_V2: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            cuda_options: *const OrtCUDAProviderOptionsV2,
        ) -> OrtStatusPtr,
    >,
    pub CreateCUDAProviderOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(out: *mut *mut OrtCUDAProviderOptionsV2) -> OrtStatusPtr,
    >,
    pub UpdateCUDAProviderOptions: ::std::option::Option<
        unsafe extern "stdcall" fn(
            cuda_options: *mut OrtCUDAProviderOptionsV2,
            provider_options_keys: *const *const ::std::os::raw::c_char,
            provider_options_values: *const *const ::std::os::raw::c_char,
            num_keys: usize,
        ) -> OrtStatusPtr,
    >,
    pub GetCUDAProviderOptionsAsString: ::std::option::Option<
        unsafe extern "stdcall" fn(
            cuda_options: *const OrtCUDAProviderOptionsV2,
            allocator: *mut OrtAllocator,
            ptr: *mut *mut ::std::os::raw::c_char,
        ) -> OrtStatusPtr,
    >,
    #[doc = " \\brief Release an ::OrtCUDAProviderOptionsV2"]
    #[doc = ""]
    #[doc = " \\note This is an exception in the naming convention of other Release* functions, as the name of the method does not have the V2 suffix, but the type does"]
    #[doc = ""]
    #[doc = " \\since Version 1.11."]
    pub ReleaseCUDAProviderOptions:
        ::std::option::Option<unsafe extern "stdcall" fn(input: *mut OrtCUDAProviderOptionsV2)>,
    pub SessionOptionsAppendExecutionProvider_MIGraphX: ::std::option::Option<
        unsafe extern "stdcall" fn(
            options: *mut OrtSessionOptions,
            migraphx_options: *const OrtMIGraphXProviderOptions,
        ) -> OrtStatusPtr,
    >,
}
#[test]
fn bindgen_test_layout_OrtApi() {
    assert_eq!(
        ::std::mem::size_of::<OrtApi>(),
        840usize,
        concat!("Size of: ", stringify!(OrtApi))
    );
    assert_eq!(
        ::std::mem::align_of::<OrtApi>(),
        4usize,
        concat!("Alignment of ", stringify!(OrtApi))
    );
    fn test_field_CreateStatus() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateStatus) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateStatus)
            )
        );
    }
    test_field_CreateStatus();
    fn test_field_GetErrorCode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetErrorCode) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetErrorCode)
            )
        );
    }
    test_field_GetErrorCode();
    fn test_field_GetErrorMessage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetErrorMessage) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetErrorMessage)
            )
        );
    }
    test_field_GetErrorMessage();
    fn test_field_CreateEnv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateEnv) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateEnv)
            )
        );
    }
    test_field_CreateEnv();
    fn test_field_CreateEnvWithCustomLogger() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateEnvWithCustomLogger) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateEnvWithCustomLogger)
            )
        );
    }
    test_field_CreateEnvWithCustomLogger();
    fn test_field_EnableTelemetryEvents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EnableTelemetryEvents) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(EnableTelemetryEvents)
            )
        );
    }
    test_field_EnableTelemetryEvents();
    fn test_field_DisableTelemetryEvents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisableTelemetryEvents) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(DisableTelemetryEvents)
            )
        );
    }
    test_field_DisableTelemetryEvents();
    fn test_field_CreateSession() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateSession) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateSession)
            )
        );
    }
    test_field_CreateSession();
    fn test_field_CreateSessionFromArray() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateSessionFromArray) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateSessionFromArray)
            )
        );
    }
    test_field_CreateSessionFromArray();
    fn test_field_Run() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).Run) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(Run)
            )
        );
    }
    test_field_Run();
    fn test_field_CreateSessionOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateSessionOptions) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateSessionOptions)
            )
        );
    }
    test_field_CreateSessionOptions();
    fn test_field_SetOptimizedModelFilePath() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetOptimizedModelFilePath) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetOptimizedModelFilePath)
            )
        );
    }
    test_field_SetOptimizedModelFilePath();
    fn test_field_CloneSessionOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CloneSessionOptions) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CloneSessionOptions)
            )
        );
    }
    test_field_CloneSessionOptions();
    fn test_field_SetSessionExecutionMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetSessionExecutionMode) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetSessionExecutionMode)
            )
        );
    }
    test_field_SetSessionExecutionMode();
    fn test_field_EnableProfiling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EnableProfiling) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(EnableProfiling)
            )
        );
    }
    test_field_EnableProfiling();
    fn test_field_DisableProfiling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisableProfiling) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(DisableProfiling)
            )
        );
    }
    test_field_DisableProfiling();
    fn test_field_EnableMemPattern() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EnableMemPattern) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(EnableMemPattern)
            )
        );
    }
    test_field_EnableMemPattern();
    fn test_field_DisableMemPattern() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisableMemPattern) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(DisableMemPattern)
            )
        );
    }
    test_field_DisableMemPattern();
    fn test_field_EnableCpuMemArena() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EnableCpuMemArena) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(EnableCpuMemArena)
            )
        );
    }
    test_field_EnableCpuMemArena();
    fn test_field_DisableCpuMemArena() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisableCpuMemArena) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(DisableCpuMemArena)
            )
        );
    }
    test_field_DisableCpuMemArena();
    fn test_field_SetSessionLogId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetSessionLogId) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetSessionLogId)
            )
        );
    }
    test_field_SetSessionLogId();
    fn test_field_SetSessionLogVerbosityLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetSessionLogVerbosityLevel) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetSessionLogVerbosityLevel)
            )
        );
    }
    test_field_SetSessionLogVerbosityLevel();
    fn test_field_SetSessionLogSeverityLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetSessionLogSeverityLevel) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetSessionLogSeverityLevel)
            )
        );
    }
    test_field_SetSessionLogSeverityLevel();
    fn test_field_SetSessionGraphOptimizationLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetSessionGraphOptimizationLevel) as usize
                    - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetSessionGraphOptimizationLevel)
            )
        );
    }
    test_field_SetSessionGraphOptimizationLevel();
    fn test_field_SetIntraOpNumThreads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetIntraOpNumThreads) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetIntraOpNumThreads)
            )
        );
    }
    test_field_SetIntraOpNumThreads();
    fn test_field_SetInterOpNumThreads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetInterOpNumThreads) as usize - ptr as usize
            },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetInterOpNumThreads)
            )
        );
    }
    test_field_SetInterOpNumThreads();
    fn test_field_CreateCustomOpDomain() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateCustomOpDomain) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateCustomOpDomain)
            )
        );
    }
    test_field_CreateCustomOpDomain();
    fn test_field_CustomOpDomain_Add() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CustomOpDomain_Add) as usize - ptr as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CustomOpDomain_Add)
            )
        );
    }
    test_field_CustomOpDomain_Add();
    fn test_field_AddCustomOpDomain() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AddCustomOpDomain) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AddCustomOpDomain)
            )
        );
    }
    test_field_AddCustomOpDomain();
    fn test_field_RegisterCustomOpsLibrary() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RegisterCustomOpsLibrary) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RegisterCustomOpsLibrary)
            )
        );
    }
    test_field_RegisterCustomOpsLibrary();
    fn test_field_SessionGetInputCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetInputCount) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetInputCount)
            )
        );
    }
    test_field_SessionGetInputCount();
    fn test_field_SessionGetOutputCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetOutputCount) as usize - ptr as usize
            },
            124usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetOutputCount)
            )
        );
    }
    test_field_SessionGetOutputCount();
    fn test_field_SessionGetOverridableInitializerCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetOverridableInitializerCount) as usize
                    - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetOverridableInitializerCount)
            )
        );
    }
    test_field_SessionGetOverridableInitializerCount();
    fn test_field_SessionGetInputTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetInputTypeInfo) as usize - ptr as usize
            },
            132usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetInputTypeInfo)
            )
        );
    }
    test_field_SessionGetInputTypeInfo();
    fn test_field_SessionGetOutputTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetOutputTypeInfo) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetOutputTypeInfo)
            )
        );
    }
    test_field_SessionGetOutputTypeInfo();
    fn test_field_SessionGetOverridableInitializerTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetOverridableInitializerTypeInfo) as usize
                    - ptr as usize
            },
            140usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetOverridableInitializerTypeInfo)
            )
        );
    }
    test_field_SessionGetOverridableInitializerTypeInfo();
    fn test_field_SessionGetInputName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetInputName) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetInputName)
            )
        );
    }
    test_field_SessionGetInputName();
    fn test_field_SessionGetOutputName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetOutputName) as usize - ptr as usize
            },
            148usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetOutputName)
            )
        );
    }
    test_field_SessionGetOutputName();
    fn test_field_SessionGetOverridableInitializerName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetOverridableInitializerName) as usize
                    - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetOverridableInitializerName)
            )
        );
    }
    test_field_SessionGetOverridableInitializerName();
    fn test_field_CreateRunOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateRunOptions) as usize - ptr as usize
            },
            156usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateRunOptions)
            )
        );
    }
    test_field_CreateRunOptions();
    fn test_field_RunOptionsSetRunLogVerbosityLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunOptionsSetRunLogVerbosityLevel) as usize
                    - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunOptionsSetRunLogVerbosityLevel)
            )
        );
    }
    test_field_RunOptionsSetRunLogVerbosityLevel();
    fn test_field_RunOptionsSetRunLogSeverityLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunOptionsSetRunLogSeverityLevel) as usize
                    - ptr as usize
            },
            164usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunOptionsSetRunLogSeverityLevel)
            )
        );
    }
    test_field_RunOptionsSetRunLogSeverityLevel();
    fn test_field_RunOptionsSetRunTag() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunOptionsSetRunTag) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunOptionsSetRunTag)
            )
        );
    }
    test_field_RunOptionsSetRunTag();
    fn test_field_RunOptionsGetRunLogVerbosityLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunOptionsGetRunLogVerbosityLevel) as usize
                    - ptr as usize
            },
            172usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunOptionsGetRunLogVerbosityLevel)
            )
        );
    }
    test_field_RunOptionsGetRunLogVerbosityLevel();
    fn test_field_RunOptionsGetRunLogSeverityLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunOptionsGetRunLogSeverityLevel) as usize
                    - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunOptionsGetRunLogSeverityLevel)
            )
        );
    }
    test_field_RunOptionsGetRunLogSeverityLevel();
    fn test_field_RunOptionsGetRunTag() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunOptionsGetRunTag) as usize - ptr as usize
            },
            180usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunOptionsGetRunTag)
            )
        );
    }
    test_field_RunOptionsGetRunTag();
    fn test_field_RunOptionsSetTerminate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunOptionsSetTerminate) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunOptionsSetTerminate)
            )
        );
    }
    test_field_RunOptionsSetTerminate();
    fn test_field_RunOptionsUnsetTerminate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunOptionsUnsetTerminate) as usize - ptr as usize
            },
            188usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunOptionsUnsetTerminate)
            )
        );
    }
    test_field_RunOptionsUnsetTerminate();
    fn test_field_CreateTensorAsOrtValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateTensorAsOrtValue) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateTensorAsOrtValue)
            )
        );
    }
    test_field_CreateTensorAsOrtValue();
    fn test_field_CreateTensorWithDataAsOrtValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateTensorWithDataAsOrtValue) as usize - ptr as usize
            },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateTensorWithDataAsOrtValue)
            )
        );
    }
    test_field_CreateTensorWithDataAsOrtValue();
    fn test_field_IsTensor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IsTensor) as usize - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(IsTensor)
            )
        );
    }
    test_field_IsTensor();
    fn test_field_GetTensorMutableData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTensorMutableData) as usize - ptr as usize
            },
            204usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetTensorMutableData)
            )
        );
    }
    test_field_GetTensorMutableData();
    fn test_field_FillStringTensor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FillStringTensor) as usize - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(FillStringTensor)
            )
        );
    }
    test_field_FillStringTensor();
    fn test_field_GetStringTensorDataLength() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetStringTensorDataLength) as usize - ptr as usize
            },
            212usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetStringTensorDataLength)
            )
        );
    }
    test_field_GetStringTensorDataLength();
    fn test_field_GetStringTensorContent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetStringTensorContent) as usize - ptr as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetStringTensorContent)
            )
        );
    }
    test_field_GetStringTensorContent();
    fn test_field_CastTypeInfoToTensorInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CastTypeInfoToTensorInfo) as usize - ptr as usize
            },
            220usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CastTypeInfoToTensorInfo)
            )
        );
    }
    test_field_CastTypeInfoToTensorInfo();
    fn test_field_GetOnnxTypeFromTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetOnnxTypeFromTypeInfo) as usize - ptr as usize
            },
            224usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetOnnxTypeFromTypeInfo)
            )
        );
    }
    test_field_GetOnnxTypeFromTypeInfo();
    fn test_field_CreateTensorTypeAndShapeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateTensorTypeAndShapeInfo) as usize - ptr as usize
            },
            228usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateTensorTypeAndShapeInfo)
            )
        );
    }
    test_field_CreateTensorTypeAndShapeInfo();
    fn test_field_SetTensorElementType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetTensorElementType) as usize - ptr as usize
            },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetTensorElementType)
            )
        );
    }
    test_field_SetTensorElementType();
    fn test_field_SetDimensions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetDimensions) as usize - ptr as usize
            },
            236usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetDimensions)
            )
        );
    }
    test_field_SetDimensions();
    fn test_field_GetTensorElementType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTensorElementType) as usize - ptr as usize
            },
            240usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetTensorElementType)
            )
        );
    }
    test_field_GetTensorElementType();
    fn test_field_GetDimensionsCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetDimensionsCount) as usize - ptr as usize
            },
            244usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetDimensionsCount)
            )
        );
    }
    test_field_GetDimensionsCount();
    fn test_field_GetDimensions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetDimensions) as usize - ptr as usize
            },
            248usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetDimensions)
            )
        );
    }
    test_field_GetDimensions();
    fn test_field_GetSymbolicDimensions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSymbolicDimensions) as usize - ptr as usize
            },
            252usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetSymbolicDimensions)
            )
        );
    }
    test_field_GetSymbolicDimensions();
    fn test_field_GetTensorShapeElementCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTensorShapeElementCount) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetTensorShapeElementCount)
            )
        );
    }
    test_field_GetTensorShapeElementCount();
    fn test_field_GetTensorTypeAndShape() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTensorTypeAndShape) as usize - ptr as usize
            },
            260usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetTensorTypeAndShape)
            )
        );
    }
    test_field_GetTensorTypeAndShape();
    fn test_field_GetTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTypeInfo) as usize - ptr as usize
            },
            264usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetTypeInfo)
            )
        );
    }
    test_field_GetTypeInfo();
    fn test_field_GetValueType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetValueType) as usize - ptr as usize
            },
            268usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetValueType)
            )
        );
    }
    test_field_GetValueType();
    fn test_field_CreateMemoryInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateMemoryInfo) as usize - ptr as usize
            },
            272usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateMemoryInfo)
            )
        );
    }
    test_field_CreateMemoryInfo();
    fn test_field_CreateCpuMemoryInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateCpuMemoryInfo) as usize - ptr as usize
            },
            276usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateCpuMemoryInfo)
            )
        );
    }
    test_field_CreateCpuMemoryInfo();
    fn test_field_CompareMemoryInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CompareMemoryInfo) as usize - ptr as usize
            },
            280usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CompareMemoryInfo)
            )
        );
    }
    test_field_CompareMemoryInfo();
    fn test_field_MemoryInfoGetName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MemoryInfoGetName) as usize - ptr as usize
            },
            284usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(MemoryInfoGetName)
            )
        );
    }
    test_field_MemoryInfoGetName();
    fn test_field_MemoryInfoGetId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MemoryInfoGetId) as usize - ptr as usize
            },
            288usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(MemoryInfoGetId)
            )
        );
    }
    test_field_MemoryInfoGetId();
    fn test_field_MemoryInfoGetMemType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MemoryInfoGetMemType) as usize - ptr as usize
            },
            292usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(MemoryInfoGetMemType)
            )
        );
    }
    test_field_MemoryInfoGetMemType();
    fn test_field_MemoryInfoGetType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).MemoryInfoGetType) as usize - ptr as usize
            },
            296usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(MemoryInfoGetType)
            )
        );
    }
    test_field_MemoryInfoGetType();
    fn test_field_AllocatorAlloc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AllocatorAlloc) as usize - ptr as usize
            },
            300usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AllocatorAlloc)
            )
        );
    }
    test_field_AllocatorAlloc();
    fn test_field_AllocatorFree() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AllocatorFree) as usize - ptr as usize
            },
            304usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AllocatorFree)
            )
        );
    }
    test_field_AllocatorFree();
    fn test_field_AllocatorGetInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AllocatorGetInfo) as usize - ptr as usize
            },
            308usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AllocatorGetInfo)
            )
        );
    }
    test_field_AllocatorGetInfo();
    fn test_field_GetAllocatorWithDefaultOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetAllocatorWithDefaultOptions) as usize - ptr as usize
            },
            312usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetAllocatorWithDefaultOptions)
            )
        );
    }
    test_field_GetAllocatorWithDefaultOptions();
    fn test_field_AddFreeDimensionOverride() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AddFreeDimensionOverride) as usize - ptr as usize
            },
            316usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AddFreeDimensionOverride)
            )
        );
    }
    test_field_AddFreeDimensionOverride();
    fn test_field_GetValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetValue) as usize - ptr as usize
            },
            320usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetValue)
            )
        );
    }
    test_field_GetValue();
    fn test_field_GetValueCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetValueCount) as usize - ptr as usize
            },
            324usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetValueCount)
            )
        );
    }
    test_field_GetValueCount();
    fn test_field_CreateValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateValue) as usize - ptr as usize
            },
            328usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateValue)
            )
        );
    }
    test_field_CreateValue();
    fn test_field_CreateOpaqueValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateOpaqueValue) as usize - ptr as usize
            },
            332usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateOpaqueValue)
            )
        );
    }
    test_field_CreateOpaqueValue();
    fn test_field_GetOpaqueValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetOpaqueValue) as usize - ptr as usize
            },
            336usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetOpaqueValue)
            )
        );
    }
    test_field_GetOpaqueValue();
    fn test_field_KernelInfoGetAttribute_float() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelInfoGetAttribute_float) as usize - ptr as usize
            },
            340usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelInfoGetAttribute_float)
            )
        );
    }
    test_field_KernelInfoGetAttribute_float();
    fn test_field_KernelInfoGetAttribute_int64() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelInfoGetAttribute_int64) as usize - ptr as usize
            },
            344usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelInfoGetAttribute_int64)
            )
        );
    }
    test_field_KernelInfoGetAttribute_int64();
    fn test_field_KernelInfoGetAttribute_string() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelInfoGetAttribute_string) as usize - ptr as usize
            },
            348usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelInfoGetAttribute_string)
            )
        );
    }
    test_field_KernelInfoGetAttribute_string();
    fn test_field_KernelContext_GetInputCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelContext_GetInputCount) as usize - ptr as usize
            },
            352usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelContext_GetInputCount)
            )
        );
    }
    test_field_KernelContext_GetInputCount();
    fn test_field_KernelContext_GetOutputCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelContext_GetOutputCount) as usize - ptr as usize
            },
            356usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelContext_GetOutputCount)
            )
        );
    }
    test_field_KernelContext_GetOutputCount();
    fn test_field_KernelContext_GetInput() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelContext_GetInput) as usize - ptr as usize
            },
            360usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelContext_GetInput)
            )
        );
    }
    test_field_KernelContext_GetInput();
    fn test_field_KernelContext_GetOutput() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelContext_GetOutput) as usize - ptr as usize
            },
            364usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelContext_GetOutput)
            )
        );
    }
    test_field_KernelContext_GetOutput();
    fn test_field_ReleaseEnv() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseEnv) as usize - ptr as usize
            },
            368usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseEnv)
            )
        );
    }
    test_field_ReleaseEnv();
    fn test_field_ReleaseStatus() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseStatus) as usize - ptr as usize
            },
            372usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseStatus)
            )
        );
    }
    test_field_ReleaseStatus();
    fn test_field_ReleaseMemoryInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseMemoryInfo) as usize - ptr as usize
            },
            376usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseMemoryInfo)
            )
        );
    }
    test_field_ReleaseMemoryInfo();
    fn test_field_ReleaseSession() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseSession) as usize - ptr as usize
            },
            380usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseSession)
            )
        );
    }
    test_field_ReleaseSession();
    fn test_field_ReleaseValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseValue) as usize - ptr as usize
            },
            384usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseValue)
            )
        );
    }
    test_field_ReleaseValue();
    fn test_field_ReleaseRunOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseRunOptions) as usize - ptr as usize
            },
            388usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseRunOptions)
            )
        );
    }
    test_field_ReleaseRunOptions();
    fn test_field_ReleaseTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseTypeInfo) as usize - ptr as usize
            },
            392usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseTypeInfo)
            )
        );
    }
    test_field_ReleaseTypeInfo();
    fn test_field_ReleaseTensorTypeAndShapeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseTensorTypeAndShapeInfo) as usize - ptr as usize
            },
            396usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseTensorTypeAndShapeInfo)
            )
        );
    }
    test_field_ReleaseTensorTypeAndShapeInfo();
    fn test_field_ReleaseSessionOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseSessionOptions) as usize - ptr as usize
            },
            400usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseSessionOptions)
            )
        );
    }
    test_field_ReleaseSessionOptions();
    fn test_field_ReleaseCustomOpDomain() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseCustomOpDomain) as usize - ptr as usize
            },
            404usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseCustomOpDomain)
            )
        );
    }
    test_field_ReleaseCustomOpDomain();
    fn test_field_GetDenotationFromTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetDenotationFromTypeInfo) as usize - ptr as usize
            },
            408usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetDenotationFromTypeInfo)
            )
        );
    }
    test_field_GetDenotationFromTypeInfo();
    fn test_field_CastTypeInfoToMapTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CastTypeInfoToMapTypeInfo) as usize - ptr as usize
            },
            412usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CastTypeInfoToMapTypeInfo)
            )
        );
    }
    test_field_CastTypeInfoToMapTypeInfo();
    fn test_field_CastTypeInfoToSequenceTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CastTypeInfoToSequenceTypeInfo) as usize - ptr as usize
            },
            416usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CastTypeInfoToSequenceTypeInfo)
            )
        );
    }
    test_field_CastTypeInfoToSequenceTypeInfo();
    fn test_field_GetMapKeyType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetMapKeyType) as usize - ptr as usize
            },
            420usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetMapKeyType)
            )
        );
    }
    test_field_GetMapKeyType();
    fn test_field_GetMapValueType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetMapValueType) as usize - ptr as usize
            },
            424usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetMapValueType)
            )
        );
    }
    test_field_GetMapValueType();
    fn test_field_GetSequenceElementType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSequenceElementType) as usize - ptr as usize
            },
            428usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetSequenceElementType)
            )
        );
    }
    test_field_GetSequenceElementType();
    fn test_field_ReleaseMapTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseMapTypeInfo) as usize - ptr as usize
            },
            432usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseMapTypeInfo)
            )
        );
    }
    test_field_ReleaseMapTypeInfo();
    fn test_field_ReleaseSequenceTypeInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseSequenceTypeInfo) as usize - ptr as usize
            },
            436usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseSequenceTypeInfo)
            )
        );
    }
    test_field_ReleaseSequenceTypeInfo();
    fn test_field_SessionEndProfiling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionEndProfiling) as usize - ptr as usize
            },
            440usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionEndProfiling)
            )
        );
    }
    test_field_SessionEndProfiling();
    fn test_field_SessionGetModelMetadata() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetModelMetadata) as usize - ptr as usize
            },
            444usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetModelMetadata)
            )
        );
    }
    test_field_SessionGetModelMetadata();
    fn test_field_ModelMetadataGetProducerName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ModelMetadataGetProducerName) as usize - ptr as usize
            },
            448usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ModelMetadataGetProducerName)
            )
        );
    }
    test_field_ModelMetadataGetProducerName();
    fn test_field_ModelMetadataGetGraphName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ModelMetadataGetGraphName) as usize - ptr as usize
            },
            452usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ModelMetadataGetGraphName)
            )
        );
    }
    test_field_ModelMetadataGetGraphName();
    fn test_field_ModelMetadataGetDomain() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ModelMetadataGetDomain) as usize - ptr as usize
            },
            456usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ModelMetadataGetDomain)
            )
        );
    }
    test_field_ModelMetadataGetDomain();
    fn test_field_ModelMetadataGetDescription() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ModelMetadataGetDescription) as usize - ptr as usize
            },
            460usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ModelMetadataGetDescription)
            )
        );
    }
    test_field_ModelMetadataGetDescription();
    fn test_field_ModelMetadataLookupCustomMetadataMap() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ModelMetadataLookupCustomMetadataMap) as usize
                    - ptr as usize
            },
            464usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ModelMetadataLookupCustomMetadataMap)
            )
        );
    }
    test_field_ModelMetadataLookupCustomMetadataMap();
    fn test_field_ModelMetadataGetVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ModelMetadataGetVersion) as usize - ptr as usize
            },
            468usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ModelMetadataGetVersion)
            )
        );
    }
    test_field_ModelMetadataGetVersion();
    fn test_field_ReleaseModelMetadata() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseModelMetadata) as usize - ptr as usize
            },
            472usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseModelMetadata)
            )
        );
    }
    test_field_ReleaseModelMetadata();
    fn test_field_CreateEnvWithGlobalThreadPools() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateEnvWithGlobalThreadPools) as usize - ptr as usize
            },
            476usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateEnvWithGlobalThreadPools)
            )
        );
    }
    test_field_CreateEnvWithGlobalThreadPools();
    fn test_field_DisablePerSessionThreads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).DisablePerSessionThreads) as usize - ptr as usize
            },
            480usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(DisablePerSessionThreads)
            )
        );
    }
    test_field_DisablePerSessionThreads();
    fn test_field_CreateThreadingOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateThreadingOptions) as usize - ptr as usize
            },
            484usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateThreadingOptions)
            )
        );
    }
    test_field_CreateThreadingOptions();
    fn test_field_ReleaseThreadingOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseThreadingOptions) as usize - ptr as usize
            },
            488usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseThreadingOptions)
            )
        );
    }
    test_field_ReleaseThreadingOptions();
    fn test_field_ModelMetadataGetCustomMetadataMapKeys() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ModelMetadataGetCustomMetadataMapKeys) as usize
                    - ptr as usize
            },
            492usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ModelMetadataGetCustomMetadataMapKeys)
            )
        );
    }
    test_field_ModelMetadataGetCustomMetadataMapKeys();
    fn test_field_AddFreeDimensionOverrideByName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AddFreeDimensionOverrideByName) as usize - ptr as usize
            },
            496usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AddFreeDimensionOverrideByName)
            )
        );
    }
    test_field_AddFreeDimensionOverrideByName();
    fn test_field_GetAvailableProviders() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetAvailableProviders) as usize - ptr as usize
            },
            500usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetAvailableProviders)
            )
        );
    }
    test_field_GetAvailableProviders();
    fn test_field_ReleaseAvailableProviders() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseAvailableProviders) as usize - ptr as usize
            },
            504usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseAvailableProviders)
            )
        );
    }
    test_field_ReleaseAvailableProviders();
    fn test_field_GetStringTensorElementLength() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetStringTensorElementLength) as usize - ptr as usize
            },
            508usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetStringTensorElementLength)
            )
        );
    }
    test_field_GetStringTensorElementLength();
    fn test_field_GetStringTensorElement() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetStringTensorElement) as usize - ptr as usize
            },
            512usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetStringTensorElement)
            )
        );
    }
    test_field_GetStringTensorElement();
    fn test_field_FillStringTensorElement() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FillStringTensorElement) as usize - ptr as usize
            },
            516usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(FillStringTensorElement)
            )
        );
    }
    test_field_FillStringTensorElement();
    fn test_field_AddSessionConfigEntry() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AddSessionConfigEntry) as usize - ptr as usize
            },
            520usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AddSessionConfigEntry)
            )
        );
    }
    test_field_AddSessionConfigEntry();
    fn test_field_CreateAllocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateAllocator) as usize - ptr as usize
            },
            524usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateAllocator)
            )
        );
    }
    test_field_CreateAllocator();
    fn test_field_ReleaseAllocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseAllocator) as usize - ptr as usize
            },
            528usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseAllocator)
            )
        );
    }
    test_field_ReleaseAllocator();
    fn test_field_RunWithBinding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RunWithBinding) as usize - ptr as usize
            },
            532usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RunWithBinding)
            )
        );
    }
    test_field_RunWithBinding();
    fn test_field_CreateIoBinding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateIoBinding) as usize - ptr as usize
            },
            536usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateIoBinding)
            )
        );
    }
    test_field_CreateIoBinding();
    fn test_field_ReleaseIoBinding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseIoBinding) as usize - ptr as usize
            },
            540usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseIoBinding)
            )
        );
    }
    test_field_ReleaseIoBinding();
    fn test_field_BindInput() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BindInput) as usize - ptr as usize
            },
            544usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(BindInput)
            )
        );
    }
    test_field_BindInput();
    fn test_field_BindOutput() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BindOutput) as usize - ptr as usize
            },
            548usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(BindOutput)
            )
        );
    }
    test_field_BindOutput();
    fn test_field_BindOutputToDevice() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).BindOutputToDevice) as usize - ptr as usize
            },
            552usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(BindOutputToDevice)
            )
        );
    }
    test_field_BindOutputToDevice();
    fn test_field_GetBoundOutputNames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetBoundOutputNames) as usize - ptr as usize
            },
            556usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetBoundOutputNames)
            )
        );
    }
    test_field_GetBoundOutputNames();
    fn test_field_GetBoundOutputValues() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetBoundOutputValues) as usize - ptr as usize
            },
            560usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetBoundOutputValues)
            )
        );
    }
    test_field_GetBoundOutputValues();
    fn test_field_ClearBoundInputs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ClearBoundInputs) as usize - ptr as usize
            },
            564usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ClearBoundInputs)
            )
        );
    }
    test_field_ClearBoundInputs();
    fn test_field_ClearBoundOutputs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ClearBoundOutputs) as usize - ptr as usize
            },
            568usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ClearBoundOutputs)
            )
        );
    }
    test_field_ClearBoundOutputs();
    fn test_field_TensorAt() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).TensorAt) as usize - ptr as usize
            },
            572usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(TensorAt)
            )
        );
    }
    test_field_TensorAt();
    fn test_field_CreateAndRegisterAllocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateAndRegisterAllocator) as usize - ptr as usize
            },
            576usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateAndRegisterAllocator)
            )
        );
    }
    test_field_CreateAndRegisterAllocator();
    fn test_field_SetLanguageProjection() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetLanguageProjection) as usize - ptr as usize
            },
            580usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetLanguageProjection)
            )
        );
    }
    test_field_SetLanguageProjection();
    fn test_field_SessionGetProfilingStartTimeNs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionGetProfilingStartTimeNs) as usize - ptr as usize
            },
            584usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionGetProfilingStartTimeNs)
            )
        );
    }
    test_field_SessionGetProfilingStartTimeNs();
    fn test_field_SetGlobalIntraOpNumThreads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetGlobalIntraOpNumThreads) as usize - ptr as usize
            },
            588usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetGlobalIntraOpNumThreads)
            )
        );
    }
    test_field_SetGlobalIntraOpNumThreads();
    fn test_field_SetGlobalInterOpNumThreads() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetGlobalInterOpNumThreads) as usize - ptr as usize
            },
            592usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetGlobalInterOpNumThreads)
            )
        );
    }
    test_field_SetGlobalInterOpNumThreads();
    fn test_field_SetGlobalSpinControl() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetGlobalSpinControl) as usize - ptr as usize
            },
            596usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetGlobalSpinControl)
            )
        );
    }
    test_field_SetGlobalSpinControl();
    fn test_field_AddInitializer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AddInitializer) as usize - ptr as usize
            },
            600usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AddInitializer)
            )
        );
    }
    test_field_AddInitializer();
    fn test_field_CreateEnvWithCustomLoggerAndGlobalThreadPools() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateEnvWithCustomLoggerAndGlobalThreadPools) as usize
                    - ptr as usize
            },
            604usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateEnvWithCustomLoggerAndGlobalThreadPools)
            )
        );
    }
    test_field_CreateEnvWithCustomLoggerAndGlobalThreadPools();
    fn test_field_SessionOptionsAppendExecutionProvider_CUDA() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsAppendExecutionProvider_CUDA) as usize
                    - ptr as usize
            },
            608usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsAppendExecutionProvider_CUDA)
            )
        );
    }
    test_field_SessionOptionsAppendExecutionProvider_CUDA();
    fn test_field_SessionOptionsAppendExecutionProvider_ROCM() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsAppendExecutionProvider_ROCM) as usize
                    - ptr as usize
            },
            612usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsAppendExecutionProvider_ROCM)
            )
        );
    }
    test_field_SessionOptionsAppendExecutionProvider_ROCM();
    fn test_field_SessionOptionsAppendExecutionProvider_OpenVINO() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsAppendExecutionProvider_OpenVINO) as usize
                    - ptr as usize
            },
            616usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsAppendExecutionProvider_OpenVINO)
            )
        );
    }
    test_field_SessionOptionsAppendExecutionProvider_OpenVINO();
    fn test_field_SetGlobalDenormalAsZero() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetGlobalDenormalAsZero) as usize - ptr as usize
            },
            620usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetGlobalDenormalAsZero)
            )
        );
    }
    test_field_SetGlobalDenormalAsZero();
    fn test_field_CreateArenaCfg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateArenaCfg) as usize - ptr as usize
            },
            624usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateArenaCfg)
            )
        );
    }
    test_field_CreateArenaCfg();
    fn test_field_ReleaseArenaCfg() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseArenaCfg) as usize - ptr as usize
            },
            628usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseArenaCfg)
            )
        );
    }
    test_field_ReleaseArenaCfg();
    fn test_field_ModelMetadataGetGraphDescription() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ModelMetadataGetGraphDescription) as usize
                    - ptr as usize
            },
            632usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ModelMetadataGetGraphDescription)
            )
        );
    }
    test_field_ModelMetadataGetGraphDescription();
    fn test_field_SessionOptionsAppendExecutionProvider_TensorRT() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsAppendExecutionProvider_TensorRT) as usize
                    - ptr as usize
            },
            636usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsAppendExecutionProvider_TensorRT)
            )
        );
    }
    test_field_SessionOptionsAppendExecutionProvider_TensorRT();
    fn test_field_SetCurrentGpuDeviceId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetCurrentGpuDeviceId) as usize - ptr as usize
            },
            640usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetCurrentGpuDeviceId)
            )
        );
    }
    test_field_SetCurrentGpuDeviceId();
    fn test_field_GetCurrentGpuDeviceId() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetCurrentGpuDeviceId) as usize - ptr as usize
            },
            644usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetCurrentGpuDeviceId)
            )
        );
    }
    test_field_GetCurrentGpuDeviceId();
    fn test_field_KernelInfoGetAttributeArray_float() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelInfoGetAttributeArray_float) as usize
                    - ptr as usize
            },
            648usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelInfoGetAttributeArray_float)
            )
        );
    }
    test_field_KernelInfoGetAttributeArray_float();
    fn test_field_KernelInfoGetAttributeArray_int64() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelInfoGetAttributeArray_int64) as usize
                    - ptr as usize
            },
            652usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelInfoGetAttributeArray_int64)
            )
        );
    }
    test_field_KernelInfoGetAttributeArray_int64();
    fn test_field_CreateArenaCfgV2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateArenaCfgV2) as usize - ptr as usize
            },
            656usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateArenaCfgV2)
            )
        );
    }
    test_field_CreateArenaCfgV2();
    fn test_field_AddRunConfigEntry() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).AddRunConfigEntry) as usize - ptr as usize
            },
            660usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(AddRunConfigEntry)
            )
        );
    }
    test_field_AddRunConfigEntry();
    fn test_field_CreatePrepackedWeightsContainer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreatePrepackedWeightsContainer) as usize - ptr as usize
            },
            664usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreatePrepackedWeightsContainer)
            )
        );
    }
    test_field_CreatePrepackedWeightsContainer();
    fn test_field_ReleasePrepackedWeightsContainer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleasePrepackedWeightsContainer) as usize
                    - ptr as usize
            },
            668usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleasePrepackedWeightsContainer)
            )
        );
    }
    test_field_ReleasePrepackedWeightsContainer();
    fn test_field_CreateSessionWithPrepackedWeightsContainer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateSessionWithPrepackedWeightsContainer) as usize
                    - ptr as usize
            },
            672usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateSessionWithPrepackedWeightsContainer)
            )
        );
    }
    test_field_CreateSessionWithPrepackedWeightsContainer();
    fn test_field_CreateSessionFromArrayWithPrepackedWeightsContainer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateSessionFromArrayWithPrepackedWeightsContainer)
                    as usize
                    - ptr as usize
            },
            676usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateSessionFromArrayWithPrepackedWeightsContainer)
            )
        );
    }
    test_field_CreateSessionFromArrayWithPrepackedWeightsContainer();
    fn test_field_SessionOptionsAppendExecutionProvider_TensorRT_V2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsAppendExecutionProvider_TensorRT_V2)
                    as usize
                    - ptr as usize
            },
            680usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsAppendExecutionProvider_TensorRT_V2)
            )
        );
    }
    test_field_SessionOptionsAppendExecutionProvider_TensorRT_V2();
    fn test_field_CreateTensorRTProviderOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateTensorRTProviderOptions) as usize - ptr as usize
            },
            684usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateTensorRTProviderOptions)
            )
        );
    }
    test_field_CreateTensorRTProviderOptions();
    fn test_field_UpdateTensorRTProviderOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UpdateTensorRTProviderOptions) as usize - ptr as usize
            },
            688usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(UpdateTensorRTProviderOptions)
            )
        );
    }
    test_field_UpdateTensorRTProviderOptions();
    fn test_field_GetTensorRTProviderOptionsAsString() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTensorRTProviderOptionsAsString) as usize
                    - ptr as usize
            },
            692usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetTensorRTProviderOptionsAsString)
            )
        );
    }
    test_field_GetTensorRTProviderOptionsAsString();
    fn test_field_ReleaseTensorRTProviderOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseTensorRTProviderOptions) as usize - ptr as usize
            },
            696usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseTensorRTProviderOptions)
            )
        );
    }
    test_field_ReleaseTensorRTProviderOptions();
    fn test_field_EnableOrtCustomOps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).EnableOrtCustomOps) as usize - ptr as usize
            },
            700usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(EnableOrtCustomOps)
            )
        );
    }
    test_field_EnableOrtCustomOps();
    fn test_field_RegisterAllocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).RegisterAllocator) as usize - ptr as usize
            },
            704usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(RegisterAllocator)
            )
        );
    }
    test_field_RegisterAllocator();
    fn test_field_UnregisterAllocator() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UnregisterAllocator) as usize - ptr as usize
            },
            708usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(UnregisterAllocator)
            )
        );
    }
    test_field_UnregisterAllocator();
    fn test_field_IsSparseTensor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).IsSparseTensor) as usize - ptr as usize
            },
            712usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(IsSparseTensor)
            )
        );
    }
    test_field_IsSparseTensor();
    fn test_field_CreateSparseTensorAsOrtValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateSparseTensorAsOrtValue) as usize - ptr as usize
            },
            716usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateSparseTensorAsOrtValue)
            )
        );
    }
    test_field_CreateSparseTensorAsOrtValue();
    fn test_field_FillSparseTensorCoo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FillSparseTensorCoo) as usize - ptr as usize
            },
            720usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(FillSparseTensorCoo)
            )
        );
    }
    test_field_FillSparseTensorCoo();
    fn test_field_FillSparseTensorCsr() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FillSparseTensorCsr) as usize - ptr as usize
            },
            724usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(FillSparseTensorCsr)
            )
        );
    }
    test_field_FillSparseTensorCsr();
    fn test_field_FillSparseTensorBlockSparse() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).FillSparseTensorBlockSparse) as usize - ptr as usize
            },
            728usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(FillSparseTensorBlockSparse)
            )
        );
    }
    test_field_FillSparseTensorBlockSparse();
    fn test_field_CreateSparseTensorWithValuesAsOrtValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateSparseTensorWithValuesAsOrtValue) as usize
                    - ptr as usize
            },
            732usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateSparseTensorWithValuesAsOrtValue)
            )
        );
    }
    test_field_CreateSparseTensorWithValuesAsOrtValue();
    fn test_field_UseCooIndices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UseCooIndices) as usize - ptr as usize
            },
            736usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(UseCooIndices)
            )
        );
    }
    test_field_UseCooIndices();
    fn test_field_UseCsrIndices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UseCsrIndices) as usize - ptr as usize
            },
            740usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(UseCsrIndices)
            )
        );
    }
    test_field_UseCsrIndices();
    fn test_field_UseBlockSparseIndices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UseBlockSparseIndices) as usize - ptr as usize
            },
            744usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(UseBlockSparseIndices)
            )
        );
    }
    test_field_UseBlockSparseIndices();
    fn test_field_GetSparseTensorFormat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSparseTensorFormat) as usize - ptr as usize
            },
            748usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetSparseTensorFormat)
            )
        );
    }
    test_field_GetSparseTensorFormat();
    fn test_field_GetSparseTensorValuesTypeAndShape() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSparseTensorValuesTypeAndShape) as usize
                    - ptr as usize
            },
            752usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetSparseTensorValuesTypeAndShape)
            )
        );
    }
    test_field_GetSparseTensorValuesTypeAndShape();
    fn test_field_GetSparseTensorValues() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSparseTensorValues) as usize - ptr as usize
            },
            756usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetSparseTensorValues)
            )
        );
    }
    test_field_GetSparseTensorValues();
    fn test_field_GetSparseTensorIndicesTypeShape() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSparseTensorIndicesTypeShape) as usize - ptr as usize
            },
            760usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetSparseTensorIndicesTypeShape)
            )
        );
    }
    test_field_GetSparseTensorIndicesTypeShape();
    fn test_field_GetSparseTensorIndices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetSparseTensorIndices) as usize - ptr as usize
            },
            764usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetSparseTensorIndices)
            )
        );
    }
    test_field_GetSparseTensorIndices();
    fn test_field_HasValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).HasValue) as usize - ptr as usize
            },
            768usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(HasValue)
            )
        );
    }
    test_field_HasValue();
    fn test_field_KernelContext_GetGPUComputeStream() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).KernelContext_GetGPUComputeStream) as usize
                    - ptr as usize
            },
            772usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(KernelContext_GetGPUComputeStream)
            )
        );
    }
    test_field_KernelContext_GetGPUComputeStream();
    fn test_field_GetTensorMemoryInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetTensorMemoryInfo) as usize - ptr as usize
            },
            776usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetTensorMemoryInfo)
            )
        );
    }
    test_field_GetTensorMemoryInfo();
    fn test_field_GetExecutionProviderApi() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetExecutionProviderApi) as usize - ptr as usize
            },
            780usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetExecutionProviderApi)
            )
        );
    }
    test_field_GetExecutionProviderApi();
    fn test_field_SessionOptionsSetCustomCreateThreadFn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsSetCustomCreateThreadFn) as usize
                    - ptr as usize
            },
            784usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsSetCustomCreateThreadFn)
            )
        );
    }
    test_field_SessionOptionsSetCustomCreateThreadFn();
    fn test_field_SessionOptionsSetCustomThreadCreationOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsSetCustomThreadCreationOptions) as usize
                    - ptr as usize
            },
            788usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsSetCustomThreadCreationOptions)
            )
        );
    }
    test_field_SessionOptionsSetCustomThreadCreationOptions();
    fn test_field_SessionOptionsSetCustomJoinThreadFn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsSetCustomJoinThreadFn) as usize
                    - ptr as usize
            },
            792usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsSetCustomJoinThreadFn)
            )
        );
    }
    test_field_SessionOptionsSetCustomJoinThreadFn();
    fn test_field_SetGlobalCustomCreateThreadFn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetGlobalCustomCreateThreadFn) as usize - ptr as usize
            },
            796usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetGlobalCustomCreateThreadFn)
            )
        );
    }
    test_field_SetGlobalCustomCreateThreadFn();
    fn test_field_SetGlobalCustomThreadCreationOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetGlobalCustomThreadCreationOptions) as usize
                    - ptr as usize
            },
            800usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetGlobalCustomThreadCreationOptions)
            )
        );
    }
    test_field_SetGlobalCustomThreadCreationOptions();
    fn test_field_SetGlobalCustomJoinThreadFn() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SetGlobalCustomJoinThreadFn) as usize - ptr as usize
            },
            804usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SetGlobalCustomJoinThreadFn)
            )
        );
    }
    test_field_SetGlobalCustomJoinThreadFn();
    fn test_field_SynchronizeBoundInputs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SynchronizeBoundInputs) as usize - ptr as usize
            },
            808usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SynchronizeBoundInputs)
            )
        );
    }
    test_field_SynchronizeBoundInputs();
    fn test_field_SynchronizeBoundOutputs() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SynchronizeBoundOutputs) as usize - ptr as usize
            },
            812usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SynchronizeBoundOutputs)
            )
        );
    }
    test_field_SynchronizeBoundOutputs();
    fn test_field_SessionOptionsAppendExecutionProvider_CUDA_V2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).SessionOptionsAppendExecutionProvider_CUDA_V2) as usize
                    - ptr as usize
            },
            816usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(SessionOptionsAppendExecutionProvider_CUDA_V2)
            )
        );
    }
    test_field_SessionOptionsAppendExecutionProvider_CUDA_V2();
    fn test_field_CreateCUDAProviderOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).CreateCUDAProviderOptions) as usize - ptr as usize
            },
            820usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(CreateCUDAProviderOptions)
            )
        );
    }
    test_field_CreateCUDAProviderOptions();
    fn test_field_UpdateCUDAProviderOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).UpdateCUDAProviderOptions) as usize - ptr as usize
            },
            824usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(UpdateCUDAProviderOptions)
            )
        );
    }
    test_field_UpdateCUDAProviderOptions();
    fn test_field_GetCUDAProviderOptionsAsString() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).GetCUDAProviderOptionsAsString) as usize - ptr as usize
            },
            828usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(GetCUDAProviderOptionsAsString)
            )
        );
    }
    test_field_GetCUDAProviderOptionsAsString();
    fn test_field_ReleaseCUDAProviderOptions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<OrtApi>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ReleaseCUDAProviderOptions) as usize - ptr as usize
            },
            832usize,
            concat!(
                "Offset of field: ",
                stringify!(OrtApi),
                "::",
                stringify!(ReleaseCUDAProviderOptions)
            )
        );
    }
    test_field_ReleaseCUDAProviderOptions();
    fn test_field_SessionOptionsAppendExecutionProvider_MIGraphX() {
        assert_eq!(
            unsafe {
