{"_ST0_": 50257, "_ST1_": 50258, "_ST2_": 50259, "_ST3_": 50260, "_ST4_": 50261, "_ST5_": 50262, "_ST6_": 50263, "_ST7_": 50264, "_ST8_": 50265, "_ST9_": 50266, "_ST10_": 50267, "_ST11_": 50268, "_ST12_": 50269, "_ST13_": 50270, "_ST14_": 50271, "_ST15_": 50272, "_ST16_": 50273, "_ST17_": 50274, "_ST18_": 50275, "_ST19_": 50276, "_ST20_": 50277, "_ST21_": 50278, "_ST22_": 50279, "_ST23_": 50280, "_ST24_": 50281, "_ST25_": 50282, "_ST26_": 50283, "_ST27_": 50284, "_ST28_": 50285, "_ST29_": 50286, "_ST30_": 50287, "_ST31_": 50288, "_ST32_": 50289, "_ST33_": 50290, "_ST34_": 50291, "_ST35_": 50292, "_ST36_": 50293, "_ST37_": 50294, "_ST38_": 50295, "_ST39_": 50296}