{"output_attentions": false, "output_hidden_states": false, "output_past": true, "torchscript": false, "use_bfloat16": false, "pruned_heads": {}, "is_decoder": false, "max_length": 20, "do_sample": false, "num_beams": 1, "temperature": 1.0, "top_k": 50, "top_p": 1.0, "repetition_penalty": 1.0, "bos_token_id": 0, "pad_token_id": 0, "eos_token_ids": 0, "length_penalty": 1.0, "num_return_sequences": 1, "finetuning_task": null, "num_labels": 1, "id2label": {"0": "LABEL_0"}, "label2id": {"LABEL_0": 0}, "architectures": ["GPT2LMHeadModel"], "vocab_size": 50297, "n_ctx": 1024, "n_positions": 1024, "n_embd": 1024, "n_layer": 1, "n_head": 16, "resid_pdrop": 0.1, "embd_pdrop": 0.1, "attn_pdrop": 0.1, "layer_norm_epsilon": 1e-05, "initializer_range": 0.02, "summary_type": "cls_index", "summary_use_proj": true, "summary_activation": null, "summary_first_dropout": 0.1, "summary_proj_to_labels": true, "model_type": "gpt2"}