{"bos_token": "<|endoftext|>", "eos_token": "<|endoftext|>", "unk_token": "<|endoftext|>", "pad_token": "_ST39_", "additional_special_tokens": ["_ST0_", "_ST1_", "_ST2_", "_ST3_", "_ST4_", "_ST5_", "_ST6_", "_ST7_", "_ST8_", "_ST9_", "_ST10_", "_ST11_", "_ST12_", "_ST13_", "_ST14_", "_ST15_", "_ST16_", "_ST17_", "_ST18_", "_ST19_", "_ST20_", "_ST21_", "_ST22_", "_ST23_", "_ST24_", "_ST25_", "_ST26_", "_ST27_", "_ST28_", "_ST29_", "_ST30_", "_ST31_", "_ST32_", "_ST33_", "_ST34_", "_ST35_", "_ST36_", "_ST37_", "_ST38_", "_ST39_"]}